/*
================================================================================
檔案代號:sma_file
檔案名稱:製造管理系統--環境資源設定系統參數
檔案目的:
上游檔案:
下游檔案:
檔案類型:P
多語系檔案:N
============.========================.==========================================
*/
create table sma_file
(
sma00       nvarchar(1) NOT NULL,    /*KEY VALUE(0)                           */
                                     /*KEY VALUE(0)                         SYS*/
sma01       nvarchar(1),             /*目前 Tiptop 系統是否可開放使           */
                                     /*目前 Tiptop 系統是否可開放使用。     SYS*/
                                     /*將會影響使用者可執行作業之功能及範圍   */
                                     /*正確值 Y/N                             */
                                     /*Y: 正常使用                            */
                                     /*N: 僅供使用者列印、查詢                */
                                     /*   不可作檔案資料的新增、修改、刪除    */
sma02       nvarchar(1),             /*是否與銷售管理系統相連                 */
                                     /*是否與銷售管理系統相連。             SYS*/
                                     /*正確值 Y/N                             */
                                     /*Y: 有與銷售管理系統相連                */
                                     /*N: 不與銷售管理系統相連                */
sma03       nvarchar(1),             /*是否與總帳管理系統相連                 */
                                     /*是否與總帳管理系統相連。             SYS*/
                                     /*正確值 Y/N                             */
                                     /*Y: 有與總帳管理系統相連                */
                                     /*N: 不與總帳管理系統相連                */
sma04       nvarchar(1),             /*是否與應付帳款管理系統相連             */
                                     /*是否與應付帳款管理系統相連。         SYS*/
                                     /*正確值 Y/N                             */
                                     /*Y: 有與應付帳款管理系統相連            */
                                     /*N: 不與應付帳款管理系統相連            */
sma05       nvarchar(1),             /*是否與批次追蹤管理系統相連             */
                                     /*是否與批次追蹤管理系統相連。         SYS*/
                                     /*正確值 Y/N                             */
                                     /*Y: 有與批次追蹤管理系統相連            */
                                     /*N: 不與批次追蹤管理系統相連            */
                                     /*目前尚未使用                           */
sma06       nvarchar(1),             /*是否與專案管理系統相連                 */
                                     /*是否與專案管理系統相連。             SYS*/
                                     /*正確值 Y/N                             */
                                     /*Y: 有與專案管理系統相連                */
                                     /*N: 不與專案管理系統相連                */
                                     /*目前尚未使用                           */
sma07       nvarchar(1),             /*是否與條碼系統相連                     */
                                     /*是否與條碼系統相連。                 SYS*/
                                     /*正確值 Y/N                             */
                                     /*Y: 有使用條碼系統                      */
                                     /*N: 無使用條碼系統                      */
                                     /*目前尚未使用                           */
sma08       nvarchar(1),             /*是否與量產製造管理系統相連             */
                                     /*是否與量產製造管理系統相連。         SYS*/
                                     /*正確值 Y/N                             */
                                     /*Y: 有與量產製造管理系統相連            */
                                     /*N: 不與量產製造管理系統相連            */
sma09       nvarchar(1),             /*是否可在產品結構維護作業處             */
                                     /*是否可在產品結構維護作業處理中；     ITM*/
                                     /*同時輸入新的料件。                     */
                                     /*正確值 Y/N                             */
                                     /*Y: 則可在處理中，直接以視窗方式輸入    */
                                     /*   料件編號及某一部份之料件基本資料    */
                                     /*N: 不允許輸入新的料件                  */
sma10       nvarchar(1),             /*會計科目參照對應資料維護作             */
                                     /*會計科目參照對應資料維護作業中；     SYS*/
                                     /*所對應的會計科目是否需存在總帳管       */
                                     /*理系統中的會計科目主檔。               */
                                     /*正確值 Y/N                             */
                                     /*Y: 輸入之會計科目需存在總帳管理的      */
                                     /*   會計科目主檔中                      */
                                     /*N: 輸入之會計科目不作任何檢查          */
sma100      nvarchar(1),             /*E-BOM轉P-BOM時料件編號需存在料         */
                                     /*'Y':Yes                                */
                                     /*'N':No                                 */
sma101      nvarchar(1),             /*BOM表發放後是否可以修改單身            */
                                     /*'Y':Yes                                */
                                     /*'N':No                                 */
sma102      nvarchar(1),             /*AVL是否與QVL串聯                       */
                                     /*'Y':Yes                                */
                                     /*'N':No                                 */
sma103      nvarchar(1),             /*收貨單無承認文號時的管制方             */
                                     /*0.不處理                               */
                                     /*1.警告                                 */
                                     /*2.拒絕                                 */
sma104      nvarchar(1),             /*是否使用聯產品(Y/N)                    */
                                     /*是否使用聯產品(Y/N)    #NO:6872        */
sma105      nvarchar(1),             /*認定聯產品的時機點為(1/2)              */
                                     /*聯產品的時機點為(1/2)  #NO:6872        */
                                     /*1.FQC                                  */
                                     /*2.完工入庫                             */
sma106      nvarchar(1),             /*系統重要資料異動是否發mail通           */
sma107      nvarchar(1),             /*發料時是否可做取替代(Y/N)              */
sma108      nvarchar(1),             /*已收貨是否可變更採購單價(Y/N           */
                                     /*已收貨是否可變更採購單價(Y/N) #NO:7231 */
sma109      nvarchar(1),             /*採購單價大於最近採購單價之             */
                                     /*採購單價大於最近採購單價之超限率時,    */
                                     /*超限處理方式(R/W)             #NO:7231 */
sma11       nvarchar(1),             /*'0':台灣                               */
                                     /*'1':歐美                               */
                                     /*'2':大陸                               */
sma110      smallint,                /*收貨單身儲存最大筆數                   */
                                     /*收貨單身儲存最大筆數          #NO:7231 */
sma111      nvarchar(1),             /*是否使用移動加權平均                   */
                                     /*是否使用移動加權平均(Y/N)     #NO:7231 */
sma112      nvarchar(1),             /*採購單價可否為零                       */
                                     /*採購單價可否為零(Y/N)         #NO:7231 */
sma113      nvarchar(1),             /*Blanket PO轉採購單價認定               */
                                     /*Blanket PO轉採購單價認定:     #NO:7231 */
                                     /*1.以Blanket PO單價 2.採購單價 3.取低者 */
sma114      nvarchar(1),             /*委外採購是否影響料件最近採             */
                                     /*委外採購是否影響料件最近採購單價(Y/N)  */
                                     /*#NO:7231                               */
sma115      nvarchar(1),             /*使用雙單位                             */
                                     /*no use                                 */
sma116      nvarchar(1),             /*是否使用計價單位                       */
                                     /*0:不使用                               */
                                     /*1:採購                                 */
                                     /*2:銷售                                 */
                                     /*3:兩者                                 */
sma117      nvarchar(1),             /*庫存不足是否自動拆箱                   */
                                     /*no use                                 */
sma118      nvarchar(1),             /*是否使用特性BOM功能                    */
                                     /*no use                                 */
sma119      nvarchar(1),             /*料件編號資料長度                       */
                                     /*no use                                 */
sma12       nvarchar(1),             /*是否為使用多倉儲管理                   */
                                     /*是否為使用多倉儲管理。               INV*/
                                     /*單或多倉儲庫存將會直接影響倉庫儲位     */
                                     /*之管理方式外，在 TIPTOP 系統中亦將     */
                                     /*會影響某些功能且庫存檔案資料的產生     */
                                     /*使用亦會完全相異。                     */
                                     /*正確值 Y/N                             */
                                     /*Y: 使用多倉儲庫存管理方式              */
                                     /*N: 使用單一倉儲庫存管理方式            */
sma120      nvarchar(1),             /*是否使用多屬性料件                     */
sma121      nvarchar(1),             /*使用特性BOM的行業別                    */
sma122      nvarchar(1),             /*使用多單位的單位管制方式               */
sma123      nvarchar(5),             /*庫存不足自動拆箱調撥單單別             */
sma124      nvarchar(10),            /*行業別                                 */
sma125      nvarchar(1),             /*訂單審核是否自動產生正式BOM            */
sma126      nvarchar(1) DEFAULT ' ' NOT NULL, /*工序移轉是否檢查單元報工*/
sma127      nvarchar(1) DEFAULT ' ' NOT NULL, /*工序移轉是否檢查裁片移轉套 */
sma128      nvarchar(1),             /*使用混合包裝                           */
sma129      nvarchar(1),             /*發料控管套數否                         */
sma13       decimal(18),             /*料件庫存ABC分類 到A類所佔百            */
                                     /*料件庫存ABC分類 到A類所佔百分比。    INV*/
                                     /*正確值 介於'0'到'100'之間 且 不        */
                                     /*大於 '到B類所佔百分比'。               */
sma130      nvarchar(1),             /*MRP銷售預測數量分攤方式                */
sma131      nvarchar(16) DEFAULT 'N',/*工藝委外入庫后自動產生移轉             */
sma132      nvarchar(1) DEFAULT 'Y' NOT NULL, /*在途量是否計算Y.是N.否*/
sma133      decimal(18),             /*分配可超請購比率%                      */
sma134      smallint,                /*採購可收貨次數                         */
sma135      nvarchar(1) DEFAULT 'N' NOT NULL, /*收貨是否重新取價*/
sma136      nvarchar(1) DEFAULT '1' NOT NULL, /*自動補貨計算方式1.送貨週期2.*/
sma137      smallint,                /*DMS週期天數                            */
sma138      nvarchar(1) DEFAULT 'Y' NOT NULL, /*安全存量是否計算Y.是 N.否*/
sma139      nvarchar(1) DEFAULT 'N' NOT NULL, /*盤點結案時刪除盤點資料*/
sma14       decimal(18),             /*料件庫存ABC分類 到B類所佔百            */
                                     /*料件庫存ABC分類 到B類所佔百分比。    INV*/
                                     /*正確值 介於'0'到'100'之間 且 不        */
                                     /*小於 '到A類所佔百分比'。               */
                                     /* 如 A類佔  00-80%                      */
                                     /*    B類佔 80%-90%                      */
                                     /*    C類佔 90%-100%                     */
                                     /* 則 sma13 = 80.00, sma14 = 90.00       */
sma140      nvarchar(1) DEFAULT 'N' NOT NULL, /*配送依收貨過賬*/
sma141      nvarchar(1) DEFAULT '0' NOT NULL, /*分量計算損耗率否*/
sma1421     nvarchar(1) DEFAULT ' ' NOT NULL, /*使用號機管理否*/
sma1422     nvarchar(1) DEFAULT ' ' NOT NULL, /*訂單是否必須輸入計畫批號*/
sma1423     nvarchar(1) DEFAULT ' ' NOT NULL, /*工單按照計畫批號自動產生號 */
sma1424     nvarchar(1) DEFAULT ' ' NOT NULL, /*工單按照號機自動產生計畫批 */
sma1431     nvarchar(1) DEFAULT ' ' NOT NULL, /*是否啟用關鍵工序報工功能*/
sma1432     nvarchar(1) DEFAULT ' ' NOT NULL, /*是否啟用工藝委外自動生成採 */
sma1433     nvarchar(1) DEFAULT ' ' NOT NULL, /*是否啟用工藝委外自動生成收 */
sma1434     nvarchar(1) DEFAULT ' ' NOT NULL, /*工藝工單不移轉直接入庫時是 */
sma1435     nvarchar(1) DEFAULT ' ' NOT NULL, /*報工單採用實際工時否*/
sma15       smallint,                /*ABC分類 A類循環盤點週期建議            */
                                     /*ABC分類 A類循環盤點週期建議天數。    INV*/
                                     /*記錄 A類料件循還盤點一週期天數。       */
                                     /*正確值 大於'0'之值                     */
sma16       smallint,                /*ABC分類 B類循環盤點週期建議            */
                                     /*ABC分類 B類循環盤點週期建議天數。    INV*/
                                     /*記錄 B類料件循還盤點一週期天數。       */
                                     /*正確值 大於'0'之值                     */
sma17       smallint,                /*ABC分類 C類循環盤點週期建議            */
                                     /*ABC分類 C類循環盤點週期建議天數。    INV*/
                                     /*記錄 C類料件循還盤點一週期天數。       */
                                     /*正確值 大於'0'之值                     */
sma18       nvarchar(1),             /*低階碼是否需重新計算                   */
                                     /*低階碼是否需重新計算                 BOM*/
                                     /*記錄系統中產品結構是否有被修改過，     */
                                     /*而導致料件低階碼可能不正確而需系       */
                                     /*統重新加以計算的訊息。                 */
                                     /*系統維護。                             */
                                     /*正確值 Y/N                             */
                                     /*Y: 需重新加以計算                      */
                                     /*N: 不需重新計算                        */
sma19       smallint,                /*產品結構項次間隔數目                   */
                                     /*產品結構項次間隔數目                 BOM*/
sma20       smallint,                /*過期資料保留期間數                     */
                                     /*過期資料保留期間數                   ACT*/
                                     /*異動記錄檔(tlf_file) 切割時使用之      */
sma21       datetime,                /*最後一次MRP需求展開日期                */
                                     /*最後一次MRP需求展開日期。            MRP*/
                                     /*記錄系統最後一次MRP需求展開日期。      */
sma22       nvarchar(1),             /*MRP需求時使用時距                      */
                                     /*MRP需求時使用時距。                  MRP*/
                                     /*記錄經料需求計劃後，如欲產生計劃       */
                                     /*訂/工單(Plan Orders)時，彙總的時       */
                                     /*距範圍。                               */
                                     /*正確值 '1/2/3/4                        */
                                     /*1: 無特定時距                          */
                                     /*2: 以'日'為時距                        */
                                     /*3: 以'週'為時距                        */
                                     /*4: 以'旬'為時距                        */
                                     /*5: 以'月'為時距                        */
sma23       nvarchar(1),             /*人工成本取得計算方式                   */
                                     /*人工成本取得計算方式。               PCS*/
                                     /*決定料件產品成本中，人工成本的取得     */
                                     /*來源。                                 */
                                     /*正確值 1/2/3                           */
                                     /*1: 使用成本中心                        */
                                     /*2: 使用工作中心及標準製程              */
                                     /*3: 依料件使用設定而定                  */
                                     /*   可在料件資料主檔 [ima_file] 中的    */
                                     /*   [成本中心] 欄,註記使用的成本中心    */
                                     /*   -如採用成本中心制，否則則不輸入     */
sma24       nvarchar(1),             /*是否使用標準成本制                     */
                                     /*是否使用標準成本制。                 SYS*/
                                     /*正確值 Y/N                             */
                                     /*Y: 系統運作使用標準成本制              */
                                     /*N: 系統運作使用實際成本制              */
sma25       nvarchar(1),             /*採購料件成本計算方式                   */
                                     /*採購料件成本計算方式。               PUR*/
                                     /*正確值 0/1/2/3/4/5                     */
                                     /*0: 不作任何成本異動                    */
                                     /*1: 加權平均成本計算後，對料件基本資    */
                                     /*   料─成本要素值中的標準成本作修改。   */
                                     /*2: 以最近一次採購成本，對料件基本資    */
                                     /*   料─成本要素值中的標準成本作修改。   */
                                     /*如採用標準成本制(sma24='Y')，則不可    */
                                     /*選擇'1' 或 '2'。                       */
sma26       nvarchar(1),             /*工單生產製程追蹤設定                   */
                                     /*工單生產製程追蹤設定。               SFC*/
                                     /*正確值 1/2/3                           */
                                     /*1: 不使用製程追蹤。                    */
                                     /*   不需產生製程追蹤資料。              */
                                     /*2: 使用製程追蹤。                      */
                                     /*   製程追蹤資料於確認生產工單時產生。  */
                                     /*3: 使用製程追蹤。                      */
                                     /*   製程追蹤資料於工單發放時產生。      */
sma27       nvarchar(1),             /*工單下階備料資料產生時機               */
                                     /*工單下階備料資料產生時機             SFC*/
                                     /*1: 工單輸入時立即產生。                */
                                     /*2: 工單發放時產生。                    */
                                     /*3: 人為決定產生時機(工單輸入後,發放前) */
sma28       nvarchar(1),             /*工單排程使用方式                       */
                                     /*工單排程使用方式。                   SFC*/
                                     /*正確值 1/2                             */
                                     /*1: 時距排程。                          */
                                     /*   使用料件主檔時距資料。              */
                                     /*2: 製程排程。                          */
                                     /*   使用製程作業時距資料。              */
sma29       nvarchar(1),             /*No Use                                 */
sma30       datetime,                /*目前系統使用的工作日                   */
                                     /*目前系統使用的工作日                 SYS*/
                                     /*記錄目前 TIPTOP 系統載入有效工作日，   */
                                     /*將會在每次起動系統時,將日期記錄依公    */
                                     /*司行事曆自動設定。                     */
                                     /*系統維護。                             */
sma31       nvarchar(1),             /*是否使用請購功能                       */
                                     /*是否使用請購功能。                   PUR*/
                                     /*記錄是否指定使用 TIPTOP 系統的請購     */
                                     /*管理系統功能。                         */
                                     /*正確值 Y/N                             */
                                     /*Y: 指定使用。                          */
                                     /*N: 不指定使用。                        */
sma32       nvarchar(1),             /*請購與採購是否要互相勾稽               */
                                     /*請購與採購是否要互相勾稽。           PUR*/
                                     /*記錄請購數量及單價轉成採購後是否作     */
                                     /*勾稽。                                 */
                                     /*正確值 Y/N                             */
sma33       nvarchar(1),             /*請購與採購若勾稽時，差異處             */
                                     /*請購與採購若勾稽時，差異處理方式。   PUR*/
                                     /*正確值 R/W                             */
                                     /*R: 數量或單價不符時，拒絕接受。        */
                                     /*W: 數量或單價不符時，依各類別之差異    */
                                     /*   百分比作處理且顯示警告訊息。        */
sma341      decimal(18),             /*A類 採購數量大於請購數量之             */
                                     /*A類 採購數量大於請購數量之百分比     PUR*/
                                     /*記錄請購與採購勾稽時， A類數量差異     */
                                     /*容忍度。                               */
sma342      decimal(18),             /*B類 採購數量大於請購數量之             */
                                     /*B類 採購數量大於請購數量之百分比     PUR*/
                                     /*記錄請購與採購勾稽時， B類數量差異     */
                                     /*容忍度。                               */
sma343      decimal(18),             /*C類 採購數量大於請購數量之             */
                                     /*C類 採購數量大於請購數量之百分比     PUR*/
                                     /*記錄請購與採購勾稽時， C類數量差異     */
                                     /*容忍度。                               */
sma351      decimal(18),             /*A類 採購單價大於請購單價之             */
                                     /*A類 採購單價大於請購單價之百分比     PUR*/
                                     /*記錄請購與採購勾稽時， A類單價差異     */
                                     /*容忍度。                               */
sma352      decimal(18),             /*B類 採購單價大於請購單價之             */
                                     /*B類 採購單價大於請購單價之百分比     PUR*/
                                     /*記錄請購與採購勾稽時， B類單價差異     */
                                     /*容忍度。                               */
sma353      decimal(18),             /*C類 採購單價大於請購單價之             */
                                     /*C類 採購單價大於請購單價之百分比     PUR*/
                                     /*記錄請購與採購勾稽時， C類單價差異     */
                                     /*容忍度。                               */
sma36       nvarchar(1),             /*是否使用採購預算                       */
                                     /*是否使用採購預算                     PUR*/
                                     /*記錄採購管理系統是否作採購預算稽核，   */
                                     /*如果作採購預算稽核，則必須與總帳管理   */
                                     /*系統相連。                             */
                                     /*正確值 Y/N                             */
                                     /*Y: 作採購預算稽核。                    */
                                     /*N: 不作採購預算稽核。                  */
sma37       decimal(18),             /*採購預算超限比率                       */
                                     /*採購預算超限比率                     PUR*/
                                     /*記錄採購管理系統如果作採購預算稽核，   */
                                     /*其差異容忍度。                         */
sma38       nvarchar(1),             /*是否可在請購/採購單維護作業            */
                                     /*是否可在請購/採購單維護作業處理中，  ITM*/
                                     /*同時輸入新的料件。                     */
                                     /*正確值 Y/N                             */
                                     /*Y: 則可在處理中，直接以視窗方式輸入    */
                                     /*   料件編號及某一部份之料件基本資料。  */
                                     /*N: 不允許輸入新的料件。                */
sma39       nvarchar(1),             /*是否可不經由'倉儲基本資料維            */
                                     /*是否可不經由'倉儲基本資料維護作業'   INV*/
                                     /*，加入新的倉儲。                       */
                                     /*正確值 Y/N                             */
                                     /*Y: 可加入新的倉儲。                    */
                                     /*N: 不可加入新的倉儲。                  */
sma401      decimal(18),             /*A類 超短交限率                         */
                                     /*A類 超短交限率。                     PUR*/
                                     /*A類料件採購交貨數量容忍度。            */
                                     /*正值 表上下限率超短交管制。            */
                                     /*零值 表不可超短交。                    */
                                     /*負值 表不作管制。                      */
sma402      decimal(18),             /*B類 超短交限率                         */
                                     /*B類 超短交限率。                     PUR*/
                                     /*B類料件採購交貨數量容忍度。            */
                                     /*正值 表上下限率超短交管制。            */
                                     /*零值 表不可超短交。                    */
                                     /*負值 表不作管制。                      */
sma403      decimal(18),             /*C類 超短交限率                         */
                                     /*C類 超短交限率。                     PUR*/
                                     /*C類料件採購交貨數量容忍度。            */
                                     /*正值 表上下限率超短交管制。            */
                                     /*零值 表不可超短交。                    */
                                     /*負值 表不作管制。                      */
sma41       nvarchar(1),             /*外購收貨是否檢查提單號碼               */
                                     /*外購收貨是否檢查提單號碼00/01/18 modify*/
sma42       nvarchar(1),             /*料件存放位置管制方式                   */
                                     /*料件存放位置管制方式。               INV*/
                                     /*設定料件存放倉庫及儲位管制原則。       */
                                     /*正確值 1/2/3                           */
                                     /*1: 使用預設料件/倉庫。                 */
                                     /*   所有料件入庫時均需事先設定可存放    */
                                     /*   倉庫，使用者僅可決定儲位。          */
                                     /*2: 使用預設料件/倉庫/儲位關係。        */
                                     /*   所有料件入庫時均已被設定，使用者    */
                                     /*   不可自行決定。                      */
                                     /*3: 輸入時自行決定。                    */
                                     /*   所有料件入庫時使用者可自行決定。    */
sma43       nvarchar(1),             /*庫存成本計價方式                       */
                                     /*庫存成本計價方式。                   ACT*/
                                     /*設定料件庫存成本計價管制原則。         */
                                     /*在此原則決定之下料件庫存的耗用亦會受   */
                                     /*影響。                                 */
                                     /*如使用標準成本制則僅可選擇 1/2/5。     */
                                     /*正確值 1/2/3/4/5                       */
                                     /*1: 先進先出法。                        */
                                     /*   標準成本制下每批耗用成本是相同。    */
                                     /*   非標準成本制下每批耗用成本按其      */
                                     /*   個別成本。                          */
                                     /*2: 後進先出法。                        */
                                     /*   標準成本制下每批耗用成本是相同。    */
                                     /*   非標準成本制下每批耗用成本按其      */
                                     /*   個別成本。                          */
                                     /*3: 加權平均法(移動加權平均法)。        */
                                     /*   僅非標準成本制下方可使用。          */
                                     /*   每批料件入庫時，會作加權平均其      */
                                     /*   庫存成本。                          */
                                     /*4: 月加權平均法。                      */
                                     /*   僅非標準成本制下方可使用。          */
                                     /*   每批料件入庫後，經全月彙總後作      */
                                     /*   月期間加權平均其庫存成本。          */
sma44       nvarchar(1),             /*請購單是否可直接輸入                   */
                                     /*請購單是否可直接輸入。               PUR*/
                                     /*設定公司所有請購項目是否皆由主排程及   */
                                     /*料需求計劃規劃而來。                   */
                                     /*正確值 Y/N                             */
                                     /*Y: 表示請購項目可由使用者直接決定其    */
                                     /*   需求而透過請購單輸入。              */
                                     /*N: 表示請購單資料必須由主排程及料需    */
                                     /*   求計劃規劃而來。                    */
sma45       nvarchar(1),             /*採購單是否可直接輸入                   */
                                     /*採購單是否可直接輸入。               PUR*/
                                     /*設定公司所有請購採購是否皆由請購、主   */
                                     /*排程及料需求計劃規劃而來。             */
                                     /*正確值 Y/N                             */
                                     /*Y: 表示採購項目可由使用者直接決定其    */
                                     /*   需求而透過請購單輸入。              */
                                     /*N: 表示採購單資料必須由請購、主排程及  */
                                     /*   料需求計劃規劃而來。                */
sma46       nvarchar(1),             /*分隔符號                               */
sma47       nvarchar(1),             /*ABC碼計算設定方式                      */
                                     /*ABC碼計算設定方式。              INV   */
                                     /*設定料件庫存ABC分類計算基準。          */
                                     /*正確值 1/3/4                           */
                                     /*1: 依過去期間使用金額。                */
                                     /*   (過去期間使用量*標準成本)。         */
                                     /*3: 依標準成本。                        */
                                     /*   *期間使用量=                        */
                                     /*    入庫數量+出庫數量+銷貨數量。       */
                                     /*4: 依現時成本。                        */
                                     /*   來源碼為採購料件時，                */
                                     /*   計算方式為：本階現時採購成本。      */
                                     /*   來源碼為非採購料件時，              */
                                     /*   計算方式為：本階現時成+下階現時成本。*/
sma48       smallint,                /*ABC碼計算期間數設定                    */
                                     /*ABC碼計算期間數設定。                INV*/
                                     /*設定ABC碼計算時所採用的期間基準。      */
                                     /*僅在計算基準為 1/2 時，方輸入。        */
sma49       nvarchar(1),             /*ABC碼排定標準設定                      */
                                     /*ABC碼排定標準設定。                  INV*/
                                     /*設定ABC碼計算時所含括料件種類。        */
                                     /*正確值 1/2                             */
                                     /*1: 依指定之分群碼。                    */
                                     /*2: 全部料件。                          */
sma50       nvarchar(1),             /*庫存發料使用方式                       */
                                     /*庫存發料使用方式。                   INV*/
                                     /*設定料件庫存耗用原則。                 */
                                     /*必須與庫存成本計價方式配合使用。       */
                                     /*1: 先進先出法。FIFO                    */
                                     /*   按料件入庫先後決定其耗用順序，      */
                                     /*   進而影響其耗用成本。                */
                                     /*   配合庫存成本計價方式='1'使用。      */
                                     /*2: 後進先出法。LIFO                    */
                                     /*   按料件入庫先後決定其耗用順序，      */
                                     /*   進而影響其耗用成本。                */
                                     /*   配合庫存成本計價方式='2'使用。      */
                                     /*3: 個別鑑定法(依發料優先順序)          */
                                     /*   料件庫存耗用順序由發料優先順序決定。*/
                                     /*   配合庫存成本計價方式='3/4/5'使用。  */
                                     /*4: 個別鑑定法。                        */
                                     /*   料件庫存耗用順序由使用者自行決定。  */
                                     /*   配合庫存成本計價方式='3/4/5'使用。  */
sma51       smallint,                /*目前單據輸入會計年度                   */
                                     /*目前單據輸入會計年度。               SYS*/
                                     /*所有庫存異動作業單據日期不可大於本欄年度*/
sma52       smallint,                /*目前單據輸入會計期別                   */
                                     /*目前單據輸入會計期別(月份)。         SYS*/
                                     /*所有庫存異動作業單據日期不可大於本欄月份*/
sma53       datetime,                /*成本關帳日期                           */
                                     /*成本關帳日期                         SYS*/
                                     /*所有庫存異動作業單據日期不可小於關帳日期*/
sma54       nvarchar(1),             /*是否使用製程                           */
                                     /*是否使用製程。                        RT*/
                                     /*設定目前 TIPTOP 系統是否使用製程。     */
                                     /*正確值 Y/N                             */
                                     /*Y: 有使用製程。                        */
                                     /*N: 無使用製程。                        */
sma541      nvarchar(1) DEFAULT ' ' NOT NULL, /*使用平行工藝否  Y/N*/
sma542      nvarchar(1) DEFAULT ' ' NOT NULL, /*使用製程BOM否  Y/N*/
sma55       nvarchar(1),             /*是否做製程單元管理                     */
                                     /*是否做製程單元管理(Y/N)               RT*/
sma551      smallint,                /*每人每天工作時間                       */
                                     /*每人每天工作時間(分) add 99/04/22     RT*/
sma56       nvarchar(1),             /*料需求規劃時供給量是否考慮             */
                                     /*料需求規劃時供給量是否考慮請購量。   MRP*/
                                     /*料需求計劃規劃時，供給量中是否需考慮   */
                                     /*包括請購量。                           */
                                     /*正確值 1/2/3                           */
                                     /*1: 全部列入考慮。                      */
                                     /*   只要為開立的請購單其數量均列入考量。*/
                                     /*2: 已核淮方才列入考慮。                */
                                     /*   僅有已核淮的請購單其數量才列入考量。*/
                                     /*3: 全部不允許列入考慮。                */
                                     /*   所有請購單其數量均不列入考量。      */
sma57       nvarchar(1),             /*料需求規劃時供給量中對採購             */
                                     /*料需求規劃時供給量中對採購量之衡量。 MRP*/
                                     /*料需求計劃規劃時，供給量中是否考慮     */
                                     /*僅已核淮採購單的數量。                 */
                                     /*正確值 1/2                             */
                                     /*1: 全部列入考慮。                      */
                                     /*   只要為開立的採購單其數量均列入考量。*/
                                     /*2: 已核淮方才列入考慮。                */
                                     /*   僅有已核淮的採購單其數量才列入考量。*/
sma58       nvarchar(1),             /*是否使用成本項目結構                   */
                                     /*是否使用成本項目結構。               PCS*/
                                     /*設定使用者是否可自行定義產品成本結構。 */
                                     /*當在產品成本逆算時，如使用自行定義之   */
                                     /*產品成本結構時，則系統會依設定的各類   */
                                     /*成本項目計算產生產品成本資料。         */
                                     /*正確值 Y/N                             */
                                     /*Y: 可自行定義。                        */
                                     /*N: 不可自行定義。                      */
sma59       nvarchar(1),             /*工作站是否使用工作站工作曆             */
                                     /*工作站是否使用工作站工作曆。          RT*/
                                     /*設定工作站是否允許自行使用工作站自定   */
                                     /*的工作行事曆。                         */
                                     /*正確值 Y/N                             */
                                     /*Y: 工作站允許自行設定工作曆。          */
                                     /*   在工作站基本資料中可自行設定該工作  */
                                     /*   站使用的工作曆，亦可不指定而使用公  */
                                     /*   司工作行事曆。                      */
                                     /*N: 僅可使用公司工作行事曆。            */
                                     /*   在工作站基本資料中不可自行設定工作  */
                                     /*   行事曆。                            */
sma60       nvarchar(1),             /*系統處理中料號輸入是否採分             */
                                     /*系統處理中料號輸入是否採分段輸入。   SYS*/
                                     /*設定系統對料件編號在輸入時是否可採分   */
                                     /*段輸入；最高設定五段、最多合計20字符。 */
                                     /*如系統設定為料件編號可分段輸入時，需   */
                                     /*決定各段可輸入最大長度。               */
                                     /*正確值 Y/N                             */
                                     /*Y: 可分段輸入。                        */
                                     /*N: 不可分段輸入。 （建議值）           */
sma601      smallint,                /*料號第一段長度                         */
                                     /*料號第一段長度                       SYS*/
                                     /*如系統設定為料件編號可分段輸入時，第   */
                                     /*一段可輸入最大長度。                   */
                                     /*正確值 介於 1 至 20。                  */
sma602      smallint,                /*料號第二段長度                         */
                                     /*料號第二段長度                       SYS*/
                                     /*如系統設定為料件編號可分段輸入時，第   */
                                     /*二段可輸入最大長度。                   */
                                     /*正確值 介於 1 至 20。                  */
sma603      smallint,                /*料號第三段長度                         */
                                     /*料號第三段長度                       SYS*/
                                     /*如系統設定為料件編號可分段輸入時，第   */
                                     /*三段可輸入最大長度。                   */
                                     /*正確值 介於 1 至 20。                  */
sma604      smallint,                /*料號第四段長度                         */
                                     /*料號第四段長度                       SYS*/
                                     /*如系統設定為料件編號可分段輸入時，第   */
                                     /*四段可輸入最大長度。                   */
                                     /*正確值 介於 1 至 20。                  */
sma605      smallint,                /*料號第五段長度                         */
                                     /*料號第五段長度                       SYS*/
                                     /*如系統設定為料件編號可分段輸入時，第   */
                                     /*五段可輸入最大長度。                   */
                                     /*正確值 介於 1 至 20。                  */
sma609      nvarchar(1),             /*料號每段資料是否向右靠齊               */
                                     /*料號每段資料是否向右靠齊             SYS*/
                                     /*如系統設定為料件編號可分段輸入時，各   */
                                     /*段料號輸入後是否需向右靠齊。           */
                                     /*正確值 Y/N                             */
sma61       nvarchar(1),             /*廠外加工成本取得方式                   */
                                     /*廠外加工成本取得方式。               PCS*/
                                     /*當在產品成本逆算時，廠外加工成本取得   */
                                     /*來源。                                 */
                                     /*正確值 1/2                             */
                                     /*1: 使用成本要素值中的廠外加工成本。    */
                                     /*   當在產品成本逆算時，廠外加工成本    */
                                     /*   直接由料件成本要素值中的廠外加工    */
                                     /*   成本取的。                          */
                                     /*2: 使用製程/工作站資料計算而來。       */
                                     /*   當在產品成本逆算時，廠外加工成本    */
                                     /*   將透過料件製程/工作站資料計算而來。 */
sma62       nvarchar(1),             /*料件供應商管制方式                     */
                                     /*料件供應商管制方式。                 PUR*/
                                     /*設定是否所有請購料件均需預設其 購時    */
                                     /*交易廠商之關連。                       */
                                     /*正確值 1/2                             */
                                     /*1: 需作料件供應商管制。                */
                                     /*   請購/採購時，只能與該料件指定的     */
                                     /*   供應商交易。                        */
                                     /*2: 不作料件供應商管制。                */
sma63       nvarchar(1),             /*料件供應商控制方式                     */
                                     /*料件供應商控制方式。                 PUR*/
                                     /*設定是否所有請/採購料件均需預設其可    */
                                     /*交易廠商之關連。                       */
                                     /*正確值 1/2                             */
                                     /*1: 需作料件供應商管制。                */
                                     /*   採購時，只能與該料件指定的供應商    */
                                     /*   交易。                              */
                                     /*2: 不作料件供應商管制。                */
sma64       nvarchar(1),             /*品名是否採用規則化輸入法　             */
                                     /*品名是否採用規則化輸入法　           ITM*/
                                     /*設定料件品名輸入時，是否採用固定片語   */
                                     /*式規則化輸入。                         */
                                     /*正確值 Y/N                             */
sma65       nvarchar(1),             /*產品結構的元件通常以何順序             */
                                     /*產品結構的元件通常以何順序排列　     BOM*/
                                     /*設定產品結構中元件顯示順序。           */
                                     /*正確值 1/2/3                           */
                                     /*1: 按項次                              */
                                     /*2: 按元件編號                          */
                                     /*3: 按插件位置                          */
sma66       nvarchar(1),             /*工單備料時是否自動取代                 */
                                     /*工單備料時是否自動取代(Y/N)          SFC*/
sma67       nvarchar(1),             /*工單備料時是否自動替代                 */
                                     /*工單備料時是否自動替代(Y/N)          SFC*/
sma68       decimal(18),             /*快速移動料件週轉率                     */
                                     /*快速移動料件週轉率。                 INV*/
                                     /*每一庫存料件如其週轉率在此標準之上，   */
                                     /*即此料件的週轉率在快速的指標。         */
                                     /*正確值 介於 0 至 100 之間。            */
sma69       decimal(18),             /*平速移動件週轉率                       */
                                     /*平速移動件週轉率                     INV*/
                                     /*每一庫存料件如其週轉率在快速與平速     */
                                     /*的水平間，即此料件的週轉率在平速的     */
                                     /*指標每一庫存料件如其週轉率在此標準     */
                                     /*之下，即此料件的週轉換在低速的指標。   */
                                     /*正確值 介於 0 至 100 之間 且 不小於    */
                                     /*快速移動料件週轉率。                   */
sma70       nvarchar(1),             /*工單工時收集方式                       */
                                     /*工單工時收集方式。                   SFC*/
                                     /*設定工單或作業完工時，工時收集輸入     */
                                     /*方式。                                 */
                                     /*正確值 1/2                             */
                                     /*1: 系統計算。                          */
                                     /*   輸入開始日期時間及結束日期時間，    */
                                     /*   以日期:時:分輸入。                  */
                                     /*2: 直接輸入。                          */
                                     /*   輸入耗用工時。                      */
sma71       nvarchar(1),             /*工單產生下階備料時是否考慮             */
                                     /*工單產生下階備料時是否考慮損耗率。   SFC*/
                                     /*設定工單在產生下階備料應發給數量上     */
                                     /*是否加上產品結構中的預期損耗量。       */
                                     /*正確值 Y/N                             */
                                     /*Y: 加上產品結構中的預期損耗量。        */
                                     /*N: 不可加上產品結構中的預期損耗量。    */
sma72       nvarchar(1),             /*工單是否使用三階段式結案步             */
                                     /*工單是否使用三階段式結案步驟。       SFC*/
                                     /*如工單設定為分三階段式分階段結案，     */
                                     /*則可分別對材料耗用、工時收集、成本     */
                                     /*會計結算分階段性結案管制。             */
                                     /*正確值 Y/N                             */
                                     /*Y: 採用三階段。                        */
                                     /*N: 採用單一階段。                      */
                                     /*   全部狀況一次設定。                  */
sma73       nvarchar(1),             /*工單完工數量是否檢查發料最             */
                                     /*設定工單其生產數量是否與已完工入庫、   */
                                     /*再加工、全檢、報廢、會驗(MRB)量之總    */
                                     /*和作勾稽。                             */
                                     /*正確值 Y/N                             */
                                     /*Y: 需要作勾稽。                        */
                                     /*N: 不需要作勾稽。                      */
sma74       decimal(18),             /*工單完工量作勾稽時可容許差             */
                                     /*工單完工量作勾稽時可容許差異。       SFC*/
                                     /*如工單設定為需作勾稽時之可容許差異     */
                                     /*百分比值。                             */
                                     /*正確值 介於 0 至 100 之百分比值。      */
sma75       nvarchar(10),            /*預設的在製品存放倉庫                   */
                                     /*預設的在製品存放倉庫。　　           SFC*/
sma76       nvarchar(10),            /*預設的在製品存放儲位                   */
                                     /*預設的在製品存放儲位。　　           SFC*/
sma77       nvarchar(1),             /*已核准之單據變動時是否需重             */
                                     /*已核准之單據變動時是否需重新簽核。   SYS*/
                                     /*設定已核准之單據，當在料號、數量、　　 */
                                     /*金額....等重要資料更改時，是否需固     */
                                     /*定重新簽核處理動作。                   */
                                     /*正確值 1/2                             */
                                     /*1: 需重新簽核。 1998/12/28-->NO USE    */
                                     /*2: 人為決定是否重新簽核。              */
sma78       nvarchar(1),             /*工單下階備料產生時計量單位             */
                                     /*工單下階備料產生時計量單位。         SFC*/
                                     /*設定工單產生下階料件應發數量決定時  　 */
                                     /*之計量單位。基本上建議為產品結構上  　 */
                                     /*之發料單位為其計量單位。               */
                                     /*正確值 1/2                             */
                                     /*1: 庫存單位。                          */
                                     /*2: 發料單位。                          */
sma79       nvarchar(1),             /*是否使用保稅系統                       */
                                     /*是否使用保稅系統                     ABX*/
                                     /*0: No                                  */
                                     /*1: Yes                                 */
sma80       nvarchar(1),             /*工單工時輸入方式                       */
                                     /*工單工時輸入方式(1/2/3/4)            ACT*/
                                     /* 1.工單工時                            */
                                     /* 2.工作站工單工時                      */
                                     /* 3.作業員工單,機器工單工時收集         */
                                     /* 4.工單作業員,工單機器收集             */
                                     /* 1/2 nontracking use                   */
                                     /* 3/4 ntracking use                     */
sma81       nvarchar(1),             /*分針以時針表示方式                     */
                                     /*分針以時針表示方式                   ACT*/
                                     /* 1.百分比                              */
                                     /* 2.60 分制                             */
sma82       nvarchar(1),             /*成本計算考慮間接物料方式               */
                                     /*成本計算考慮間接物料方式             ACT*/
                                     /* 1.依料件主檔比例設定                  */
                                     /* 2.依產品結構用量而定                  */
sma83       nvarchar(1),             /*以核價檔與料件供應商取低者             */
                                     /*更新料件/供應商最近單價方式            */
                                     /*  1.無條件更新                       PUR*/
                                     /*  2.較低時更新                         */
                                     /*  3.不更新                             */
sma84       decimal(18),             /*採購單價大於最近採購單價之             */
                                     /*採購單價大於最近採購單價之超限率     PUR*/
sma841      nvarchar(1),             /*採購單價取價方式                       */
                                     /*採購單價取價方式                     PUR*/
                                     /*  1.料件供應商最近單價, 料件最近單價   */
                                     /*  2.料件供應商最近單價, 料件最近市價   */
                                     /*  3.料件最近單價                       */
                                     /*  4.料件最近市價                       */
                                     /*  5.依核價單價，料件最近單價           */
                                     /*  6.依核價單價, 料件供應商最近單價     */
                                     /*  7.以核價檔取價                       */
sma842      nvarchar(1),             /*採購單發出時, 更新料件供應             */
                                     /*  1.無條件更新                       PUR*/
                                     /*  2.較低時更新                         */
                                     /*  3.不更新                             */
sma843      nvarchar(1),             /*採購單發出時, 更新料件主檔             */
                                     /*  1.無條件更新                       PUR*/
                                     /*  2.較低時更新                         */
                                     /*  3.不更新                             */
sma844      nvarchar(1),             /*採購單發出時, 更新料件主檔             */
                                     /*採購單發出時, 更新料件主檔市價方式   PUR*/
                                     /*  1.無條件更新                         */
                                     /*  2.較低時更新                         */
                                     /*  3.不更新                             */
sma845      nvarchar(1),             /*低階碼可否部份重計                     */
                                     /*低階碼可否部份重計(僅BOM有異動部份重計)*/
sma846      nvarchar(1),             /*產品結構有異動時是否自動執             */
sma847      nvarchar(10),            /*第一碼雜發單是否要輸入部門             */
                                     /*第一碼雜發單是否要輸入部門  sma847-1 INV*/
                                     /*第二碼雜收單是否要輸入部門  sma847-2   */
sma848      nvarchar(10),            /*工單展備料時,若下階料件須開            */
                                     /*下階子工單開立方式                     */
                                     /*1:開窗挑選料件                         */
                                     /*2:根據BOM設定直接產生                  */
sma849      smallint,                /*Run Card 製程追蹤產生項次間隔          */
sma85       nvarchar(1),             /*收料數量大於採購數量且超出             */
                                     /*收料數量大於採購數量且超出限率時 PUR   */
                                     /*判斷差異處理方式, 正確值 'R' or 'W'    */
                                     /*'R':(Rejected)單價不符拒絕接受         */
                                     /*'W':(Warning)依各類別之差異百分比作處理*/
                                     /*     且顯示警告訊息                    */
sma86       nvarchar(5),             /*帳別編號                               */
                                     /*帳別編號                             ACT*/
sma87       nvarchar(10),            /*總帳所在營運中心編號                   */
                                     /*總帳所在營運中心編號                     ACT*/
sma88       nvarchar(1),             /*兩階段營運中心調撥,撥出單號            */
                                     /*兩階段營運中心調撥,撥出單號是否與撥入單號INV*/
                                     /*相同                                   */
                                     /*'Y':Yes                                */
                                     /*'N':No                                 */
sma881      nvarchar(1),             /*料件月平均成本單價採用方式             */
                                     /*料件月平均成本單價採用方式           ACT*/
                                     /*1.驗收單單價                           */
                                     /*2.應付帳款單價                         */
                                     /*NO USED  94/07/05                      */
sma882      nvarchar(1),             /*庫存量為零時,是否刪除庫存資            */
                                     /*庫存量為零時,是否刪除庫存資料        INV*/
                                     /*Y:Yes                                  */
                                     /*N:No                                   */
sma883      nvarchar(1),             /*試產性工單是否展至尾階                 */
                                     /*試產性工單是否展至尾階(00/01/11)     SFC*/
                                     /*Y:Yes 展至尾階                         */
                                     /*N:No  只展單階                         */
sma884      nvarchar(1),             /*兩階段倉庫調撥,撥出單號是否            */
                                     /*相同                                   */
                                     /*'Y':Yes                                */
                                     /*'N':No                                 */
sma885      nvarchar(1),             /*No Use                                 */
sma886      nvarchar(10),            /*第一碼:採購單部份交貨否預設            */
                                     /*第一碼:採購單部份交貨否預設值sma886_1PUR*/
                                     /*第二碼:採購單提前交貨否預設值 sma886_2 */
                                     /*第三碼:收料時是否同時輸入發票資料      */
                                     /*                              sma886_3 */
                                     /*第四碼:請購單輸入時,MISC料件輸入科目否 */
                                     /*                              sma886_4 */
                                     /*第五碼:採購單輸入時,MISC料件輸入科目否 */
                                     /*                              sma886_5 */
                                     /*第六碼:須檢驗(檢驗='Y')收料單是否需由品*/
                                     /*       管部門確認後才可入庫(Y/N)       */
                                     /*                              sma886_6 */
                                     /*第七碼:免驗(檢驗='N')收料單是否直接入庫*/
                                     /*                              sma886_7 */
                                     /*第八碼:採購收貨允收數量是否與IQC量勾稽 */
                                     /*                              sma886_8 */
sma887      nvarchar(10),            /*第一碼 : 工單備料是否必須存            */
                                     /*         Y:須存在BOM                   */
                                     /*         N:不檢查               sma887_1*/
                                     /*         W:檢查存在BOM否, 不存在警告之 */
                                     /*第二碼 : 已列印料表之工單其備料 sma887_2*/
                                     /*         是否可以刪除 (Y/N)            */
                                     /*第三碼 : No Use                        */
                                     /*第四碼 : No use                        */
                                     /*                                sma887_4*/
                                     /*第五碼 : No use                        */
                                     /*                                sma887_5*/
sma888      nvarchar(10),            /*第一碼 : 產品結構列印時是否            */
sma889      nvarchar(10),            /*LCM 法則                               */
                                     /*LCM 法則(1/2/3)                      ACT*/
                                     /*1.逐筆比較                             */
                                     /*2.分類比較                             */
                                     /*3.總額比較                             */
sma89       nvarchar(1),             /*成本會計採用方式                       */
                                     /*成本會計採用方式                     ACT*/
                                     /*1.分批成本制                           */
                                     /*2.分步成本制                           */
sma891      nvarchar(10),            /*各工單是否設定期末在製約當             */
                                     /*各工單是否設定期末在製約當量(Y/N)    ACT*/
                                     /*為計算工單生產料件單位成本時使用之     */
                                     /*Y:必須設定各工單料/工完工程度%         */
                                     /*N:不須設定各工單料/工完工程度%,即本期投*/
                                     /*  入之成本均由完工量來吸收,未含期末在製*/
                                     /*  約當量                               */
sma892      nvarchar(10),            /*第一碼 : 庫存帳務基礎日期方            */
                                     /*第一碼 : 庫存帳務基礎日期方式        ITM*/
                                     /*         依 (1)單據日期 (2)產生日期    */
                                     /*         sma892_1                      */
                                     /*第二碼 : 新增庫存明細檔時(img_file)    */
                                     /*         是否需要維護相關資料          */
                                     /*         sma892_2                      */
sma893      nvarchar(10),            /*第一碼 : 入庫單號流水號是否            */
                                     /*                                 NO USE*/
sma894      nvarchar(10),            /*第一碼 : 庫存不足是否許雜項            */
                                     /*第二碼 : 庫存不足是否許出貨扣帳(Y/N)   */
                                     /*第三碼 : 庫存不足是否許工單發料(Y/N)   */
                                     /*第四碼 : 庫存不足是否許調撥出庫(Y/N)   */
                                     /*第五碼 : 庫存不足是否許還料出庫(Y/N)   */
                                     /*第六碼 : 庫存不足是否允許採購退庫過帳  */
                                     /*         及入庫過帳還原(Y/N)           */
                                     /*第七碼 : 庫存不足是否允許銷退過帳還原  */
                                     /*第八碼 : 是否允許盤點過帳後庫存為負(Y/N)*/
sma895      nvarchar(10),            /*FAS 產品料號產生方式                   */
                                     /*FAS 產品料號產生方式 (1/2) 99/11/22    */
                                     /*1:指定FAS料號                          */
                                     /*2:按FAS編碼原則自動產生FAS料號         */
sma896      nvarchar(10),            /*是否要有FQC                            */
                                     /*是否要有FQC(Y/N)                     SFC*/
sma897      nvarchar(10),            /*是否可分批移轉(Y/N)                    */
                                     /*是否可分批移轉(Y/N)                  RT*/
sma898      nvarchar(10),            /*load資料之資料條件篩選起始期           */
sma899      nvarchar(1),             /*是否允許發料誤差                       */
                                     /*是否允許發料誤差(Y/N)                  */
                                     /*       No.+114             01/05/11    */
sma90       nvarchar(1),             /*收貨單做批/序號控管                    */
sma901      nvarchar(1),             /*是否與 APS 系統串聯                    */
                                     /*是否與 APS 系統串聯(Y/N)?              */
                                     /*                           02/03/13    */
sma902      nvarchar(10),            /*是否使用防偽稅控接口系統               */
                                     /*是否使用防偽稅控接口系統(Y/N) for 大陸版*/
sma903      nvarchar(10),            /*第一碼:拆箱順序                        */
                                     /*User defined parameter                 */
sma904      nvarchar(10),            /*請採購匯率使用類別                     */
                                     /*User defined parameter                 */
sma905      nvarchar(10),            /*No Use                                 */
sma906      nvarchar(10),            /*No Use                                 */
sma907      nvarchar(10),            /*單據別與屬性組是否關聯                 */
                                     /*User defined parameter                 */
sma908      nvarchar(10),            /*是否允許單據輸入時新增料件             */
                                     /*User defined parameter                 */
sma909      nvarchar(10),            /*新增多屬性料件時,復制BOM               */
                                     /*User defined parameter                 */
sma910      nvarchar(10),            /*價格評核項目代碼                       */
sma911      nvarchar(10),            /*交期評核項目代碼                       */
sma912      nvarchar(10),            /*品質評核項目代碼                       */
sma913      nvarchar(10),            /*品質異常處理成本評核項目代             */
sma914      smallint,                /*交期逾期容許天數                       */
sma915      decimal(18),             /*品質異常處理成本容許率                 */
sma916      nvarchar(1),             /*APS整合類型                            */
sma917      decimal(18) DEFAULT '0', /*資源型態                               */
smaacti     nvarchar(1),             /*資料有效碼                             */
smadate     datetime,                /*最近修改日                             */
smagrup     nvarchar(10),            /*資料所有部門                           */
smamodu     nvarchar(10),            /*資料修改者                             */
smaorig     nvarchar(10),            /*資料建立部門                           */
smaoriu     nvarchar(10),            /*資料建立者                             */
smauser     nvarchar(10)             /*資料所有者                             */
);

alter table sma_file add constraint sma_pk primary key  (sma00);
grant select on sma_file to tiptopgp;
grant update on sma_file to tiptopgp;
grant delete on sma_file to tiptopgp;
grant insert on sma_file to tiptopgp;
grant references on sma_file to tiptopgp;
grant references on sma_file to ods;
grant select on sma_file to ods;
