/*
================================================================================
檔案代號:tlf_file
檔案名稱:異動記錄檔
檔案目的:
上游檔案:
下游檔案:
檔案類型:S
多語系檔案:N
============.========================.==========================================
*/
create table tlf_file
(
rowid       
tlf01       nvarchar(40),            /*異動料件編號                           */
                                     /*儲存異動料件                           */
                                     /*--異動經由何處所發生之資料(來源)--------*/
tlf012      nvarchar(10),            /*製程段號                               */
tlf013      smallint,                /*製程序                                 */
tlf02       smallint,                /*來源狀況                               */
                                     /*儲存發生異動的來源狀況，其分類如下     */
                                     /*00: 調整／盤點                         */
                                     /*   05:一階段調整                       */
                                     /*   06:二階段調整                       */
                                     /*   07:營運中心二階段調整               */
                                     /*10: 採購                               */
                                     /*    11: 一般     採購單                */
                                     /*    14: 消耗性   採購單                */
                                     /*    16: 資材性   採購單                */
                                     /*    60: 委外加工 採購單                */
                                     /*20: 檢驗區                             */
                                     /*25: F.Q.C.                             */
                                     /*30: 退貨                               */
                                     /*    31:退貨補貨                        */
                                     /*    32:退貨扣款                        */
                                     /*40: 報廢                               */
                                     /*50: 倉庫                               */
                                     /*    55: 一階段倉庫間調撥               */
                                     /*    56: 二階段倉庫間調撥               */
                                     /*    57: 營運中心間調撥                 */
                                     /*60: 工單                               */
                                     /*    61 :一般工單                       */
                                     /*    62 :最後裝配工單                   */
                                     /*    63 :再加工工單                     */
                                     /*    64 :委外工單                       */
                                     /*    65 :拆件式工單                     */
                                     /*    66 :多營運中心工單                 */
                                     /*70: 銷單                               */
                                     /*    71: 製造管理                       */
                                     /*    72: 銷售管理                       */
                                     /*       722:出貨項次修改                */
                                     /*       723:出貨項次刪除                */
                                     /*       724:出貨項次新增                */
                                     /*       725:出貨整張刪除                */
                                     /*       731:銷退入庫                    */
                                     /*       732:銷退入庫項次修改            */
                                     /*       733:銷退入庫項次刪除            */
                                     /*       734:銷退入庫項次新增            */
                                     /*       735:銷退入庫整張刪除            */
                                     /*80: 同業                               */
                                     /*90: 雜項                               */
                                     /*100: MRB                               */
                                     /*   101: 接受                           */
                                     /*   102: 退貨補貨                       */
                                     /*   103: 退貨扣款                       */
                                     /*   104: 報廢                           */
                                     /*   105: 分類                           */
                                     /*   106: 再處理                         */
                                     /*   107: 下不為例                       */
                                     /*110:再加工                             */
                                     /*120:其它(如已分攤製費)                 */
tlf020      nvarchar(10),            /*異動來源營運中心編號                   */
                                     /*營運中心編號                           */
tlf021      nvarchar(10),            /*倉庫別                                 */
                                     /*儲存發生異動的來源倉庫別               */
                                     /*視發生異動的來源狀況是否與庫存有關，而 */
                                     /*決定是否需儲存倉庫別                   */
tlf022      nvarchar(10),            /*儲位                                   */
                                     /*儲存發生異動的來源儲位                 */
                                     /*視發生異動的來源狀況是否與庫存有關，而 */
                                     /*決定是否需儲存儲位                     */
tlf023      nvarchar(24),            /*批號                                   */
                                     /*批號 （庫存批號）                      */
                                     /*儲存發生異動的來源庫存批號             */
                                     /*視發生異動的來源狀況是否與庫存有關，而 */
                                     /*決定是否需儲存庫存批號                 */
tlf024      decimal(18),             /*異動後庫存數量                         */
                                     /*儲存發生異動的來源異動後庫存數量       */
                                     /*視發生異動的來源狀況是否與庫存有關，而 */
                                     /*決定是否需儲存異動後庫存數量           */
tlf025      nvarchar(4),             /*異動後庫存數量單位                     */
                                     /*儲存發生異動的來源異動後庫存數量單位   */
                                     /*視發生異動的來源狀況是否與庫存有關，而 */
                                     /*決定是否需儲存異動後庫存數量單位       */
tlf026      nvarchar(20),            /*單據編號                               */
                                     /*儲存發生異動的來源異動單據編號         */
                                     /*視發生異動的來源狀況是否與單據有關，而 */
                                     /*決定是否需儲存異動單據，可能為採購單、 */
                                     /*驗收單、退貨單、報廢單、調撥單、發料單 */
                                     /*借料單....等                           */
tlf027      smallint,                /*單據項次                               */
                                     /*儲存發生異動的來源異動單據明細項次     */
                                     /*視發生異動的來源狀況是否與單據有關，而 */
                                     /*決定是否需儲存異動單據明細項次資料，如 */
                                     /*該類單據無項次則其值應為'NULL'         */
                                     /*--異動至何處所發生之資料(目的)----------*/
tlf03       smallint,                /*目的狀況                               */
                                     /*儲存發生異動的目的狀況，其分類如下     */
                                     /*00: 調整／盤點                         */
                                     /*10: 採購                               */
                                     /*    11: 一般     採購單                */
                                     /*    12: 委外加工 採購單                */
                                     /*    13: 退貨補貨 採購單                */
                                     /*    14: 消耗性   採購單                */
                                     /*    15: 服務性   採購單                */
                                     /*    16: 資材性   採購單                */
                                     /*    17: 多營運中心   採購單            */
                                     /*    18: 委外代買 採購單                */
                                     /*20: 檢驗區                             */
                                     /*25: F.Q.C.                             */
                                     /*30: 退貨                               */
                                     /*    31:退貨補貨                        */
                                     /*    32:退貨扣款                        */
                                     /*40: 報廢                               */
                                     /*50: 倉庫                               */
                                     /*    55: 倉庫間調撥                     */
                                     /*60: 工單                               */
                                     /*    61 :一般工單                       */
                                     /*    62 :最後裝配工單                   */
                                     /*    63 :再加工工單                     */
                                     /*    64 :委外工單                       */
                                     /*    65 :拆件式工單                     */
                                     /*    66 :多營運中心工單                 */
                                     /*70: 銷單                               */
                                     /*    71: 製造管理                       */
                                     /*    72: 銷售管理                       */
                                     /*       722:出貨項次修改                */
                                     /*       723:出貨項次刪除                */
                                     /*       724:出貨項次新增                */
                                     /*       725:出貨整張刪除                */
                                     /*       731:銷退入庫                    */
                                     /*       732:銷退入庫項次修改            */
                                     /*       733:銷退入庫項次刪除            */
                                     /*       734:銷退入庫項次新增            */
                                     /*       735:銷退入庫整張刪除            */
                                     /*80: 同業                               */
                                     /*90: 雜項                               */
                                     /*100: MRB                               */
                                     /*   101: 接受                           */
                                     /*   102: 退貨補貨                       */
                                     /*   103: 退貨扣款                       */
                                     /*   104: 報廢                           */
                                     /*   105: 分類                           */
                                     /*   106: 再處理                         */
                                     /*   107: 下不為例                       */
                                     /*110:再加工                             */
                                     /*120:其它(如已分攤製費)                 */
tlf030      nvarchar(10),            /*異動目的營運中心編號                   */
                                     /*營運中心編號                           */
tlf031      nvarchar(10),            /*倉庫別                                 */
                                     /*儲存發生異動的目的倉庫別               */
                                     /*視發生異動的目的狀況是否與庫存有關，而 */
                                     /*決定是否需儲存倉庫別                   */
tlf032      nvarchar(10),            /*儲位                                   */
                                     /*儲存發生異動的目的儲位                 */
                                     /*視發生異動的目的狀況是否與庫存有關，而 */
                                     /*決定是否需儲存儲位                     */
tlf033      nvarchar(24),            /*批號                                   */
                                     /*批號 （庫存批號）                      */
                                     /*儲存發生異動的目的庫存批號             */
                                     /*視發生異動的目的狀況是否與庫存有關，而 */
                                     /*決定是否需儲存庫存批號                 */
tlf034      decimal(18),             /*異動後庫存數量                         */
                                     /*儲存發生異動的目的異動後庫存數量       */
                                     /*視發生異動的目的狀況是否與庫存有關，而 */
                                     /*決定是否需儲存異動後庫存數量           */
tlf035      nvarchar(4),             /*異動後庫存數量單位                     */
                                     /*儲存發生異動的目的異動後庫存數量單位   */
                                     /*視發生異動的目的狀況是否與庫存有關，而 */
                                     /*決定是否需儲存異動後庫存數量單位       */
tlf036      nvarchar(20),            /*單據編號                               */
                                     /*單據編號(參考號碼)                     */
                                     /*儲存發生異動的目的異動單據編號         */
                                     /*視發生異動的目的狀況是否與單據有關，而 */
                                     /*決定是否需儲存異動單據，可能為採購單、 */
                                     /*驗收單、退貨單、報廢單、調撥單、發料單 */
                                     /*借料單....等                           */
tlf037      smallint,                /*單據項次                               */
                                     /*儲存發生異動的目的異動單據明細項次     */
                                     /*視發生異動的目的狀況是否與單據有關，而 */
                                     /*決定是否需儲存異動單據明細項次資料，如 */
                                     /*該類單據無項次則其值應為'NULL'         */
                                     /*--異動資料------------------------------*/
tlf04       nvarchar(10),            /*工作站                                 */
                                     /*儲存發生異動的工作站                   */
tlf05       nvarchar(6),             /*作業編號                               */
                                     /*儲存發生異動的作業編號                 */
tlf06       datetime,                /*單據日期                               */
tlf07       datetime,                /*產生日期                               */
tlf08       nvarchar(8),             /*異動資料產生時間                       */
                                     /*異動資料產生時間 (時:分:秒)            */
                                     /*儲存異動資料產生時間                   */
tlf09       nvarchar(10),            /*異動資料發出者                         */
                                     /*儲存異動資料產生者                     */
tlf10       decimal(18),             /*異動數量                               */
                                     /*儲存異動數量                           */
tlf11       nvarchar(4),             /*異動數量單位                           */
                                     /*儲存異動數量單位                       */
tlf12       decimal(18),             /*異動數量單位與異動目的數量             */
                                     /*儲存異動數量單位與異動目的數量單位之間 */
                                     /*的轉換率                               */
tlf13       nvarchar(20),            /*異動命令代號                           */
                                     /*儲存異動命令代號                       */
tlf14       nvarchar(10),            /*異動原因                               */
                                     /*儲存異動原因                           */
                                     /*異動原因包括退貨原因、報廢原因         */
tlf15       nvarchar(24),            /*借方會計科目                           */
                                     /*借方會計科目 (成本計算後更新)          */
tlf151      nvarchar(24),            /*借方會計科目二                         */
                                     /*借方會計科目 (成本計算後更新)          */
tlf16       nvarchar(24),            /*貸方會計科目                           */
                                     /*貸方會計科目 (成本計算後更新)          */
tlf161      nvarchar(24),            /*貸方會計科目二                         */
                                     /*貸方會計科目 (成本計算後更新)          */
tlf17       nvarchar(255),           /*備註                                   */
tlf18       decimal(18),             /*異動後總庫存量                         */
                                     /*儲存異動後該料件總庫存數量             */
                                     /*數量單位為該料件庫存單位（料件主檔）   */
tlf19       nvarchar(10),            /*異動廠商/客戶編號/部門編號             */
                                     /*儲存異動有關的廠商/客戶編號            */
tlf20       nvarchar(10),            /*專案號碼                               */
                                     /*儲存異動有關的專案號碼                 */
tlf21       decimal(18),             /*成會異動成本                           */
                                     /*成會異動成本 (成會計算後更新)          */
tlf211      datetime,                /*成會計算日期                           */
                                     /*成會計算日期 (成本計算後更新)          */
tlf211x     datetime,                /*成會計算日期                           */
tlf212      nvarchar(8),             /*成會計算時間                           */
                                     /*成會計算時間 (成本計算後更新)          */
tlf212x     nvarchar(8),             /*成會計算時間                           */
tlf2131     smallint,                /*No Use                                 */
tlf2132     smallint,                /*No Use                                 */
tlf214      smallint,                /*No Use                                 */
tlf215      smallint,                /*No Use                                 */
tlf2151     smallint,                /*No Use                                 */
tlf216      smallint,                /*No Use                                 */
tlf2171     smallint,                /*No Use                                 */
tlf2172     smallint,                /*No Use                                 */
tlf218      nvarchar(30),            /*第二單位的rowid內容                    */
                                     /*No-use            97/06/18             */
tlf219      smallint,                /*1.第二單位   2.第一單位                */
                                     /*No-use            97/06/18             */
tlf21x      decimal(18),             /*成會異動成本                           */
tlf220      nvarchar(4),             /*單位  雙單位的單位                     */
                                     /*No-use            97/06/18             */
tlf221      decimal(18),             /*材料成本                               */
tlf221x     decimal(18),             /*材料成本                               */
tlf222      decimal(18),             /*人工成本                               */
tlf222x     decimal(18),             /*人工成本                               */
tlf2231     decimal(18),             /*製費成本                               */
tlf2231x    decimal(18),             /*製費一成本                             */
tlf2232     decimal(18),             /*加工成本                               */
tlf2232x    decimal(18),             /*加工成本                               */
tlf224      decimal(18),             /*其他成本                               */
tlf2241     decimal(18) DEFAULT '0', /*製費三成本                             */
tlf2241x    decimal(18),             /*製費三成本                             */
tlf2242     decimal(18) DEFAULT '0', /*製費四成本                             */
tlf2242x    decimal(18),             /*製費四成本                             */
tlf2243     decimal(18) DEFAULT '0', /*製費五成本                             */
tlf2243x    decimal(18),             /*製費五成本                             */
tlf224x     decimal(18),             /*製費二成本                             */
tlf225      smallint,                /*No Use                                 */
tlf2251     smallint,                /*No Use                                 */
tlf226      smallint,                /*No Use                                 */
tlf2271     smallint,                /*No Use                                 */
tlf2272     smallint,                /*No Use                                 */
tlf229      smallint,                /*No Use                                 */
tlf230      smallint,                /*No Use                                 */
tlf231      smallint,                /*No Use                                 */
tlf27       nvarchar(40),            /*被替代料號                             */
tlf28       nvarchar(1),             /*成會分類                               */
tlf41       nvarchar(30),            /*WBS編碼                                */
tlf42       nvarchar(4),             /*活動代號                               */
tlf43       nvarchar(10),            /*理由碼                                 */
tlf60       decimal(18),             /*異動單據單位對庫存單位之換             */
                                     /*異動單據單位對庫存單位(ima_file)之換算率*/
tlf61       nvarchar(5),             /*單別                                   */
                                     /*單別 (=tlf905[1,3])          97/10/27  */
tlf62       nvarchar(40),            /*工單單號                               */
                                     /*(ASR此欄是料號(asri210,asri220))       */
tlf63       integer,                 /*No Use                                 */
tlf64       nvarchar(20),            /*手冊編號                               */
                                     /*手冊編號  (A050)                       */
tlf65       nvarchar(20),            /*傳票編號                               */
tlf65x      nvarchar(20),            /*傳票編號                               */
tlf66       nvarchar(1),             /*多倉出貨 Flag                          */
                                     /*No use                                 */
tlf901      nvarchar(1),             /*成本庫別                               */
                                     /*成本庫別             97/08/23          */
                                     /*default=imd09                          */
tlf902      nvarchar(10),            /*倉庫                                   */
                                     /*倉庫                 97/06/18          */
tlf903      nvarchar(10),            /*儲位                                   */
                                     /*儲位                 97/06/18          */
tlf904      nvarchar(24),            /*批號                                   */
                                     /*批號                 97/06/18          */
tlf905      nvarchar(20),            /*單號                                   */
                                     /*單號                 97/06/18          */
tlf906      smallint,                /*項次                                   */
                                     /*項次                 97/06/18          */
tlf907      smallint,                /*入出庫碼                               */
                                     /*入出庫碼 (1:入庫   -1:出庫   0:其它    */
tlf908      nvarchar(1),             /*保稅確認否                             */
tlf909      nvarchar(1),             /*保稅擷取否                             */
tlf910      nvarchar(1),             /*合約擷取否                             */
tlf930      nvarchar(10),            /*成本中心                               */
tlf931      decimal(18),             /*內部成本                               */
tlf99       nvarchar(17),            /*多角序號                               */
tlfcost     nvarchar(40),            /*類別代號(批次號/專案號/利潤            */
tlflegal    nvarchar(10) NOT NULL,   /*所屬法人                               */
tlfplant    nvarchar(10) NOT NULL    /*所屬營運中心                           */
);

create        index tlf99 on tlf_file (tlf99);
create        index tlf_01 on tlf_file (tlf01,tlf06);
create        index tlf_03 on tlf_file (tlf62,tlf01);
create        index tlf_04 on tlf_file (tlf905,tlf906);
create        index tlf_05 on tlf_file (tlf036);
create        index tlf_06 on tlf_file (tlf026,tlf027);
create        index tlf_07 on tlf_file (tlf036,tlf037);
create        index tlfplant_idx on tlf_file (tlfplant);
alter table tlf_file add constraint tlf_pk primary key  (rowid);
grant select on tlf_file to tiptopgp;
grant update on tlf_file to tiptopgp;
grant delete on tlf_file to tiptopgp;
grant insert on tlf_file to tiptopgp;
grant references on tlf_file to tiptopgp;
grant references on tlf_file to ods;
grant select on tlf_file to ods;
