/*
================================================================================
檔案代號:ima_file
檔案名稱:料件資料主檔
檔案目的:
上游檔案:
下游檔案:
檔案類型:M
多語系檔案:N
============.========================.==========================================
*/
create table ima_file
(
ima01       nvarchar(40) NOT NULL,   /*料件編號                               */
                                     /*料件存在系統中代表編號, 是唯一的       */
ima02       nvarchar(120),           /*品名                                   */
                                     /*品名規格                               */
                                     /*描述該料件的品名規格, 如有需要進一步描述, 則可利用品名規格額外說明資料檔記錄*/
ima021      nvarchar(120),           /*規格                                   */
                                     /*規格                   (97/08/18       */
                                     /*                                       */
ima022      decimal(18) DEFAULT '0' NOT NULL, /*量化規格*/
ima03       nvarchar(20),            /*目錄參考號碼                           */
                                     /*料件所屬的目錄編號                     */
                                     /*使用者可依目錄編號歸類管理列印         */
                                     /*預設值 依分群碼類別預設 或 空白        */
ima04       nvarchar(255),           /*工程圖號                               */
                                     /*該料件所在的主要工程圖號               */
                                     /*可提供給生產/工程部門參考              */
                                     /*預設值 依分群碼類別預設 或 空白        */
ima05       nvarchar(10),            /*目前使用版本                           */
                                     /*本料件目前使用的版本編號               */
                                     /*最近工程變異版本                       */
                                     /*                                       */
ima06       nvarchar(10),            /*分群碼                                 */
                                     /*0: 表由其他相關系統而來尚未分群        */
                                     /*當在料件基本資料建立時, 可利用分群碼來 */
                                     /*預設 相關欄位基本預設值                */
ima07       nvarchar(1),             /*ABC碼                                  */
                                     /*ABC 碼                                 */
                                     /*對料件庫存作價值特性分類管理, 將會影響 */
                                     /*料件的週期盤點策略.                    */
                                     /*可透過 ABC碼計算作業 依系統建議而得    */
                                     /*A類料件應為最高價值, B類料件應為次高價 */
                                     /*值, 而C類料件應為較低價值              */
                                     /*預設值 依分群碼類別預設 或 空白        */
ima08       nvarchar(1),             /*來源碼                                 */
                                     /*說明料件屬性, 用以勾劃出不同歸屬特性的 */
                                     /*料件, 以便在料件庫存異動及物料需求 ..  */
                                     /*等作業時, 提供作業管制方式或限制       */
                                     /*正確值 C/T/D/A/M/P/X/K/U/V/R/Z/S       */
                                     /*預設值 依分群碼類別預設 或 空白, 且結果*/
                                     /*需有一種來源碼                         */
                                     /*C: 規格組件 (Configurable Product)     */
                                     /*T: 最後規格料件 (FAS Product)          */
                                     /*D: 特性料件 (Feature)                  */
                                     /*A: 族群料件 (Family Product)           */
                                     /*M: 自製料件 (Make Product)             */
                                     /*P: 採購料件 (Purchase)                 */
                                     /*X: 虛擬料件 (Phantom)                  */
                                     /*K: 配件虛擬料件 (Kit)                  */
                                     /*U: 自製大宗料件                        */
                                     /*V: 採購大宗料件                        */
                                     /*R: 在製途料件 (Routable)               */
                                     /*Z: 雜項料件 (Miscellaneous)            */
                                     /*S: 廠外加工料件 (Subcontract)          */
ima09       nvarchar(10),            /*其他分群碼 一                          */
                                     /*提供給使用者, 對料件分群/分類除在分群  */
                                     /*碼中定義外, 可提供給其它的定義方式, 以 */
                                     /*供 管理/匯集報表 使用                  */
                                     /*將可分成 一/二/三/四 四個欄位以供交互  */
                                     /*定義使用                               */
                                     /*使用者可自行定義                       */
                                     /*預設值 依分群碼類別預設 或 空白        */
ima10       nvarchar(10),            /*其他分群碼 二                          */
                                     /*提供給使用者, 對料件分群/分類除在分群  */
                                     /*碼中定義外, 可提供給其它的定義方式, 以 */
                                     /*供 管理/匯集報表 使用                  */
                                     /*將可分成 一/二/三/四 四個欄位以供交互  */
                                     /*定義使用                               */
                                     /*使用者可自行定義                       */
                                     /*預設值 依分群碼類別預設 或 空白        */
ima100      nvarchar(1),             /*檢驗程度                               */
                                     /*N.正常檢驗 T.加嚴檢驗 R.減量檢驗       */
ima1001     nvarchar(100),           /*中文名稱(全稱)                         */
ima1002     nvarchar(80),            /*英文名稱                               */
ima1003     nvarchar(20),            /*No Use                                 */
ima1004     nvarchar(10),            /*品類                                   */
ima1005     nvarchar(10),            /*品牌                                   */
ima1006     nvarchar(10),            /*系列                                   */
ima1007     nvarchar(10),            /*型別                                   */
ima1008     nvarchar(10),            /*規格                                   */
ima1009     nvarchar(10),            /*屬性                                   */
ima101      nvarchar(1),             /*檢驗水準                               */
                                     /*1.一般    2.特殊                       */
ima1010     nvarchar(1),             /*狀態碼                                 */
ima1011     decimal(18),             /*單位體積                               */
ima1012     datetime,                /*首次出貨日                             */
ima1013     datetime,                /*首次入庫日                             */
ima1014     nvarchar(1),             /*產品週期狀態                           */
ima1015     datetime,                /*預計停產日                             */
ima1016     nvarchar(40),            /*箱條碼                                 */
ima1017     decimal(18),             /*料件標準寬                             */
ima1018     decimal(18),             /*料件標準秤量                           */
ima1019     decimal(18),             /*零只長度                               */
ima102      nvarchar(1),             /*級數                                   */
ima1020     decimal(18),             /*零只寬度                               */
ima1021     decimal(18),             /*零只高度                               */
ima1022     decimal(18),             /*零只體積                               */
ima1023     decimal(18),             /*零只重量                               */
ima1024     decimal(18),             /*整箱長度                               */
ima1025     decimal(18),             /*整箱寬度                               */
ima1026     decimal(18),             /*整箱高度                               */
ima1027     decimal(18),             /*整箱體積                               */
ima1028     decimal(18),             /*整箱重量                               */
ima1029     nvarchar(1),             /*是否秤重控管                           */
ima103      nvarchar(1),             /*採購特性                               */
                                     /*分類此採購料件特性                     */
                                     /*'0':內購 '1':外購 '2':其它             */
ima104      decimal(18),             /*廠商分配限量                           */
ima105      nvarchar(1),             /*是否為軟體物件                         */
ima106      nvarchar(1),             /*保稅料件型態                           */
                                     /*保稅料件型態 (1.原料 2.半成品 3.成品  5.物料 6.客供品 7.轉運用成品) #FUN-6A0007 add 5-7*/
ima107      nvarchar(1),             /*插件位置                               */
                                     /*插件位置   #No:6542                    */
                                     /*Y:  自動開窗輸入插件位置               */
                                     /*N:不自動開窗輸入插件位置               */
ima108      nvarchar(1),             /*工單發料前調撥否                       */
                                     /*工單發料前調撥否(Y/N)                  */
                                     /*  Y:工單發料前須先依批量及最小發料量,針*/
                                     /*    對WIP倉庫存不足量, 以調撥方式調撥至*/
                                     /*    WIP倉(線上倉)補充之                */
                                     /*    但工單備料/發料時則不考慮發料倍量  */
                                     /*  N/Null:不調自動調撥(Default)         */
                                     /*SMT料判斷此欄位 Y:發SMT料 N:非SMT料    */
ima109      nvarchar(10),            /*材料類別                               */
ima11       nvarchar(10),            /*其他分群碼 三                          */
                                     /*提供給使用者, 對料件分群/分類除在分群  */
                                     /*碼中定義外, 可提供給其它的定義方式, 以 */
                                     /*供 管理/匯集報表 使用                  */
                                     /*將可分成 一/二/三/四 四個欄位以供交互  */
                                     /*定義使用                               */
                                     /*使用者可自行定義                       */
                                     /*預設值 依分群碼類別預設 或 空白        */
ima110      nvarchar(1),             /*工單開立展開選項                       */
                                     /*1.不展開                               */
                                     /*2.不展開, 但自動開立工單               */
                                     /*3.展開                                 */
                                     /*4.開窗詢問是否展開                     */
ima111      nvarchar(5),             /*預設工單單別                           */
ima12       nvarchar(10),            /*其他分群碼 四                          */
                                     /*成本分群碼                             */
ima120      nvarchar(1) DEFAULT ' ' NOT NULL, /*料件性質*/
ima121      decimal(18),             /*單位材料成本                           */
ima122      decimal(18),             /*單位人工成本                           */
ima123      decimal(18),             /*單位製造費用                           */
ima124      decimal(18),             /*單位管銷成本                           */
ima125      decimal(18),             /*單位成本                               */
                                     /*單位成本 (=料+工+費+管)                */
ima126      decimal(18),             /*基本利潤率                             */
ima127      decimal(18),             /*未稅訂價                               */
                                     /*未稅訂價(本幣)                         */
ima128      decimal(18),             /*含稅訂價                               */
                                     /*含稅訂價(本幣)                         */
ima129      decimal(18),             /*轉撥計價加計百分比                     */
ima13       nvarchar(40),            /*規格組件料件編號                       */
                                     /*如果料件來源碼為'T'(最後規格料件), 必  */
                                     /*須儲存其規格組件料件編號               */
                                     /*否則不可輸入, 應為空白                 */
                                     /*需存在料件資料主檔中, 且其料件來源碼需 */
                                     /*為'C'(規格組件)                        */
ima130      nvarchar(1),             /*產品銷售特性                           */
                                     /*  0.非產品, 不可銷售                   */
                                     /*  1.一般產品, 可直接銷售               */
                                     /*  2.PHASE OUT,<^P>查詢不顯示,仍可銷售  */
ima131      nvarchar(10),            /*產品分類編號                           */
ima132      nvarchar(24),            /*費用科目編號                           */
ima1321     nvarchar(24),            /*費用科目二                             */
ima133      nvarchar(40),            /*產品預測料號                           */
ima134      nvarchar(15),            /*主要包裝方式編號                       */
ima135      nvarchar(40),            /*產品條碼編號                           */
ima136      nvarchar(10),            /*主要WIP 倉庫                           */
ima137      nvarchar(10),            /*主要WIP 儲位                           */
ima138      nvarchar(40),            /*FCC No.                                */
                                     /*FCC#                                   */
                                     /*FCC(Federal Communications Commission) */
                                     /*美國聯邦通訊委員會 (02/06/14 alter)    */
ima139      nvarchar(1),             /*MPS 計算否                             */
ima14       nvarchar(1),             /*是否為工程料件                         */
                                     /*闡明該料件是否為工程料件, 以便分別管理 */
                                     /*工程料件及非工程料件                   */
                                     /*正確值 'Y' 或 'N'                      */
                                     /*Y: 工程料件                            */
                                     /*N: 非工程料件                          */
                                     /*預設值 依分群碼類別預設 或 'N'         */
ima140      nvarchar(1),             /*Phase Out 否                           */
ima1401     datetime,                /*生效日                                 */
ima141      nvarchar(1),             /*產品序號控制方式                       */
                                     /*產品序號(Serial No)控制方式            */
                                     /*0.不處理                               */
                                     /*1.本產品使用同一產品序號               */
                                     /*2.每次出貨均賦予產品序號               */
ima142      smallint,                /*產品序號之固定長度                     */
ima143      smallint,                /*產品序號之字首固定長度                 */
ima144      nvarchar(10),            /*產品序號之字首固定字                   */
ima145      nvarchar(1),             /*產品序號是否為固定長度                 */
ima146      nvarchar(1),             /*BOM異動否                              */
                                     /*Y.當BOM有異動時                        */
                                     /*0.當BOM有異動時,且該料為level=0 的主件 */
                                     /*Low level code 重計時更新為 NULL       */
ima147      nvarchar(1),             /*插件位置與QPA是否要勾稽                */
                                     /*插件位置與QPA是否要勾稽 #NO:6542       */
ima148      smallint,                /*保證期                                 */
                                     /*保證期(天)              #NO:7181(養生) */
ima149      nvarchar(24),            /*代銷科目                               */
ima1491     nvarchar(24),            /*代銷科目二                             */
ima15       nvarchar(1),             /*保稅與否                               */
                                     /*闡明該料件是否為保稅料件, 以便作 保稅  */
                                     /*處理作業                               */
                                     /*正確值 'Y' 或 'N'                      */
                                     /*Y: 保稅料件                            */
                                     /*N: 非保稅料件                          */
                                     /*預設值 依分群碼類別預設 或 'N'         */
ima150      nvarchar(1) DEFAULT ' ' NOT NULL, /*收貨替代方式*/
ima151      nvarchar(1) DEFAULT ' ' NOT NULL, /*母料件否*/
ima152      nvarchar(1) DEFAULT ' ' NOT NULL, /*PO對Blanket PO替代方式*/
ima153      decimal(18),             /*工單完工誤差率                         */
ima154      nvarchar(1),             /*是否為券                               */
ima155      nvarchar(1),             /*是否套裝商品                           */
ima156      nvarchar(1) DEFAULT ' ' NOT NULL, /*號機自動編碼否*/
ima157      nvarchar(10),            /*號機編碼原則                           */
ima158      nvarchar(1) DEFAULT ' ' NOT NULL, /*號機庫存管理*/
ima16       smallint,                /*低階碼                                 */
                                     /*每一料件應皆有其低階碼, 如果為產品結構 */
                                     /*中的最上階, 其低階碼將被系統設定為 '0' */
                                     /*, 而非在產品結構中最上階者, 其階數將按 */
                                     /*其由最上階往下累計最大者為其低階碼; 其 */
                                     /*它無產品結構者, 其階數亦將被設定為 '0' */
                                     /*新增料件設定初始值為 '99', 日後可透過  */
                                     /*低階碼計算作業 而得其所在階數          */
                                     /*系統維護                               */
ima17       nvarchar(4),             /*No Use                                 */
ima17_fac   decimal(18),             /*No Use                                 */
ima18       decimal(18),             /*單位重量                               */
                                     /*單位淨重 (Kg)                          */
ima19       nvarchar(4),             /*保稅料件進出口分類統計用類             */
ima1911     nvarchar(1),             /*保稅料區分                             */
                                     /* (1.保稅正料 2.保稅代用料 3.其它)  #FUN-6A0007*/
ima1912     nvarchar(40),            /*原產地                                 */
ima1913     decimal(18),             /*推廣貿易服務費                         */
ima1914     nvarchar(40),            /*稅則                                   */
ima1915     nvarchar(40),            /*帳卡編號                               */
ima1916     nvarchar(40),            /*保稅群組代碼                           */
ima1919     nvarchar(1),             /*受託加工成品否                         */
ima20       decimal(18),             /*保稅料件年度盤差容許率                 */
ima21       nvarchar(20),            /*保稅料件稅則編號                       */
ima22       decimal(18),             /*保稅料件應補稅稅率                     */
ima23       nvarchar(10),            /*倉管員                                 */
                                     /*該料件歸屬倉庫管理員                   */
                                     /*提供料件收/發料等, 庫存異動作業/單據管 */
                                     /*制, 列印依據                           */
                                     /*如果有設定倉管員, 則需存在 員工檔 內   */
                                     /*預設值 依分群碼類別預設 或 空白        */
ima24       nvarchar(1),             /*檢驗碼                                 */
                                     /*檢驗否                                 */
ima25       nvarchar(4),             /*庫存單位                               */
                                     /*料件庫存數量計算單位, 在多單位管理系統 */
                                     /*下, 此庫位單位亦為系統換算基準單位     */
                                     /*預設值 依分群碼類別預設 或 空白        */
                                     /*必須輸入一單位, 且需存在 單位檔 內     */
                                     /*在以下各所有文件說明中, 稱之'料件庫存  */
                                     /*單位'                                  */
ima251      nvarchar(4),             /*量化單位                               */
ima26       decimal(18),             /*No Use                                 */
                                     /*MPS/MRP 可用庫存數量(可用)             */
                                     /*儲存該料件可用的庫存數量, 使用料件庫存 */
                                     /*單位                                   */
                                     /*採用單一倉儲系統時, 此欄位值即為可用庫 */
                                     /*存明細數量, 其數量單位即為唯一的料件庫 */
                                     /*存單位, 可人為直接輸入                 */
                                     /*採用多倉儲系統時, 此欄位值即為所有可用 */
                                     /*庫存明細數量, 其庫存單位以料件庫存單位 */
                                     /*為基準下的可用庫存數量總和, 此欄位此時 */
                                     /*由將系統維護, 不提供人為修改           */
                                     /*新增時, 初始值設定為 '0'               */
                                     /*在以下各所有文件說明中, 稱之'料件庫存  */
                                     /*數量' 或 '可用料件庫存數量'            */
ima261      decimal(18),             /*No Use                                 */
                                     /*不可用庫存數量                         */
                                     /*儲存該料件不可用的庫存數量, 使用料件庫 */
                                     /*存單位                                 */
                                     /*採用單一倉儲系統時, 此欄位值即為不可用 */
                                     /*庫存明細數量, 其數量單位即為唯一的料件 */
                                     /*庫存單位, 可人為直接輸入               */
                                     /*採用多倉儲系統時, 此欄位值即為所有不可 */
                                     /*用庫存明細數量, 其庫存單位以料件庫存單 */
                                     /*位為基準下的不可用庫存數量總和, 此欄位 */
                                     /*此時將由系統維護, 不提供人為修改       */
                                     /*新增時, 初始值設定為 '0'               */
                                     /*在以下各所有文件說明中, 稱之'料件不可  */
                                     /*用料件庫存數量'                        */
ima262      decimal(18),             /*No Use                                 */
ima27       decimal(18),             /*安全庫存量                             */
                                     /*當在使用上, 希望在考量 MPS/MRP 產生計  */
                                     /*劃訂單(PLANNED ORDER)時, 在需求數量上  */
                                     /*能加上對庫存數量亦能維持一定的水準的庫 */
                                     /*存策略, 則可使用安全庫存量 或 安全庫存 */
                                     /*期間的作法                             */
                                     /*安全庫存量是以一固定數量來達成上述庫存 */
                                     /*策略                                   */
                                     /*預設值 依分群碼類別預設 或 '0'         */
ima271      decimal(18),             /*最高儲存數量                           */
ima28       decimal(18),             /*安全庫存期間                           */
                                     /*當在使用上, 希望在考量 MPS/MPR 產生計  */
                                     /*劃訂單(PLANNED ORDER)時, 在需求數量上  */
                                     /*能加上對庫存數量亦能維持一定的水準的庫 */
                                     /*存策略, 則可使用安全庫存量 或 安全庫存 */
                                     /*期間的作法                             */
                                     /*安全庫存期間是以一日期間需求數量來達成 */
                                     /*上述庫存策略                           */
                                     /*預設值 依分群碼類別預設 或 '0'         */
ima29       datetime,                /*最近異動日期                           */
                                     /*該料件最近一次庫存異動日期, 可能為     */
                                     /*入庫/出庫/盤點日期                     */
                                     /*系統維護                               */
ima30       datetime,                /*最近盤點日期                           */
                                     /*該料件最近一次庫存週期盤點日期         */
                                     /*系統維護                               */
ima31       nvarchar(4),             /*銷售單位                               */
                                     /*該料件的預設銷售單位, 而且在作銷售數量 */
                                     /*統計的作為基準單位                     */
                                     /*在以下各所有文件說明中, 稱之'料件銷售  */
                                     /*單位'                                  */
                                     /*預設值 依分群碼類別預設 或 料件庫存單位*/
                                     /*如果不為可銷售料件則可不輸入; 假如, 輸 */
                                     /*入之單位不為料件庫存單位時, 必須有單位 */
                                     /*間的轉換率存在, 且將儲存於下一欄位(銷售*/
                                     /*單位/庫存單位換算率)                   */
ima31_fac   decimal(18),             /*銷售單位/庫存單位換算率                */
                                     /*儲存該料件的料件銷售單位對料件庫存單位 */
                                     /*的轉換率                               */
                                     /*預設值 依分群碼類別預設 或 '0' 或 單位 */
                                     /*間設定的轉換率                         */
ima32       decimal(18),             /*標準銷售訂價                           */
                                     /*標準售價                               */
ima33       decimal(18),             /*最近銷售單價                           */
                                     /*最近售價                               */
ima34       nvarchar(10),            /*成本中心                               */
                                     /*儲存該料件成本計算時, 所屬的成本中心   */
                                     /*當 製造管理系統參數 ASM #023 = 1 時,   */
                                     /*則可依需要去設定料件歸屬成本中心, 如此 */
                                     /*便可取得計算出該料件的人工成本及製造費 */
                                     /*用, 如果未設定則料件成本要素中, 除材料 */
                                     /*成本要素外, 其餘皆不動                 */
                                     /*當 製造管理系統參數 ASM #023 = 2 時,   */
                                     /*將使用 工作站及製程 來取得計算出該料件 */
                                     /*的人工成本及製造費用, 所以不需設定成本 */
                                     /*中心, 此時此欄位無用                   */
                                     /*當 製造管理系統參數 ASM #023 = 3 時,   */
                                     /*則可依需要去設定料件歸屬成本中心, 如此 */
                                     /*便可取得計算出該料件的人工成本及製造費 */
                                     /*用(由成本中心資料), 如果未設定則料件將 */
                                     /*使用 工作站及製程 來取得計算出該料件的 */
                                     /*人工成本及製造費用                     */
                                     /*預設值 依分群碼類別預設 或 '空白'      */
                                     /*若有設定 成本中心 時, 則成本中心需存在 */
                                     /*成本中心主檔內                         */
ima35       nvarchar(10),            /*主要倉庫別                             */
                                     /*儲存該料件存放的主要倉庫編號           */
                                     /*當採用單一倉儲系統時, 本欄位不輸入     */
                                     /*當採用多倉儲系統時, 本欄位可輸入, 或由 */
                                     /*系統維護 或不輸入, 但其倉庫編號需存在  */
                                     /*倉庫資料主檔內                         */
                                     /*預設值 依分群碼類別預設 或 '空白'      */
ima36       nvarchar(10),            /*主要儲位別                             */
                                     /*儲存該料件存放的主要倉庫別中的儲位     */
                                     /*當採用單一倉儲系統時, 本欄位不輸入     */
                                     /*當採用多倉儲系統時, 本欄位可輸入, 或由 */
                                     /*系統維護 或不輸入, 但其倉庫編號/儲位   */
                                     /*需存在倉庫/存放位置資料主檔內          */
                                     /*預設值 依分群碼類別預設 或 '空白'      */
ima37       nvarchar(1),             /*補貨策略碼                             */
                                     /*對該料件在執行 MPS/MPR 時的計劃訂單/訂 */
                                     /*單數量的建議產生策略                   */
                                     /*正確值 0/1/2/3/4/5                     */
                                     /*0: 再訂購點    Reorder point parts     */
                                     /*1: MPS         MPS parts               */
                                     /*2: MRP         MRP parts               */
                                     /*3: FAS         FAS parts               */
                                     /*4: 訂單式生產  On-order parts          */
                                     /*5: 期間採購    Fixed interval parts    */
                                     /*採用 再訂購點   時, 則會依庫存數量低於 */
                                     /*                    再補貨點數量時, 產 */
                                     /*                    生計劃訂單         */
                                     /*採用 MPS        時, 則會依主生產排程產 */
                                     /*                    生計劃訂單         */
                                     /*採用 MRP        時, 則會依物料需求計劃 */
                                     /*                    產生計劃訂單       */
                                     /*採用 FAS        時, 則會依主生產排程產 */
                                     /*                    生計劃訂單         */
                                     /*採用 訂單式生產 時, 則會依物料需求計劃 */
                                     /*                    產生計劃訂單, 而訂 */
                                     /*                    購數量以滿足客戶訂 */
                                     /*                    單需求即可         */
                                     /*                    目前未使用         */
                                     /*採用 期間採購   時, 則會固定的採購期間 */
                                     /*                    固定的採購數量來產 */
                                     /*                    生計劃訂單         */
                                     /*預設值 依分群碼類別預設 或 '空白'      */
                                     /*必須有一正確值                         */
ima38       decimal(18),             /*再補貨點                               */
                                     /*儲存當補貨策略採用再訂購點方式時的再補 */
                                     /*貨點水準數量                           */
                                     /*預設值 依分群碼類別預設 或 '0'         */
                                     /*其值為'0'時, 表示使用最小生產或採購數量*/
ima39       nvarchar(24),            /*料件所屬會計科目                       */
                                     /*儲存該料件成本會計所歸屬的會計科目     */
                                     /*輸入之檢查方式, 按製造管理系統參數來檢 */
                                     /*查合法與否                             */
                                     /*預設值 依分群碼類別預設 或 '空白'      */
ima391      nvarchar(24),            /*會計科目二                             */
ima40       decimal(18),             /*累計使用數量  期間                     */
                                     /*儲存該料件目前期間/月份使用的累計數量  */
                                     /*祇有出庫時會修改此數量                 */
                                     /*系統維護                               */
ima41       decimal(18),             /*累計使用數量  年度                     */
                                     /*儲存該料件目前年度(含 目前期間累計數   */
                                     /*量)使用的累計數量                      */
                                     /*祇有出庫時會修改此數量                 */
                                     /*系統維護                               */
ima42       nvarchar(1),             /*批號追蹤方式                           */
                                     /*正確值 0/1/2                           */
                                     /*0: 無                                  */
                                     /*1: 軟性                                */
                                     /*2: 硬性                                */
ima43       nvarchar(10),            /*採購員                                 */
                                     /*如該料件為採購性料件, 則儲存該料件歸屬 */
                                     /*的請/採購員代號                        */
                                     /*如果有設定採購員, 則需存在 員工檔 內   */
                                     /*預設值 依分群碼類別預設 或 '空白'      */
ima44       nvarchar(4),             /*採購單位                               */
                                     /*該料件的預設採購單位, 而且在作採購數量 */
                                     /*統計的作為基準單位                     */
                                     /*在以下各所有文件說明中, 稱之'料件採購  */
                                     /*單位'                                  */
                                     /*預設值 依分群碼類別預設 或 料件庫存單位*/
                                     /*如果不為可採購料件則可不輸入; 假如, 輸 */
                                     /*入之單位不為料件庫存單位時, 必須有單位 */
                                     /*間的轉換率存在, 且將儲存於下一欄位(採購*/
                                     /*單位/庫存單位換算率)                   */
ima44_fac   decimal(18),             /*採購單位/庫存單位換算率                */
                                     /*儲存該料件的料件採購單位對料件庫存單位 */
                                     /*的轉換率                               */
                                     /*預設值 依分群碼類別預設 或 '0' 或 單位 */
                                     /*間設定的轉換率                         */
ima45       decimal(18),             /*採購單位倍量                           */
                                     /*如果該料件不為採購性料件時, 不需輸入   */
                                     /*儲存該料件採購時, 採購數量的稽核單位數 */
                                     /*量; 若為'0'時, 表示不稽核此項          */
                                     /*預設值 依分群碼類別預設 或 '0'         */
ima46       decimal(18),             /*最少採購數量                           */
                                     /*如果該料件不為採購性料件時, 不需輸入   */
                                     /*儲存該料件採購時, 採購數量的最低水準數 */
                                     /*量; 若為'0'時, 表示不稽核此項          */
                                     /*預設值 依分群碼類別預設 或 '0'         */
ima47       decimal(18),             /*採購損耗率                             */
                                     /*如果該料件不為採購性料件時, 不需輸入   */
                                     /*儲存該料件採購時, 交貨數量的可能發生損 */
                                     /*耗率, 為一百分比                       */
                                     /*計劃訂單數量需考慮此數量               */
                                     /*預設值 依分群碼類別預設 或 '0'         */
ima48       decimal(18),             /*採購安全期                             */
                                     /*交貨到前置時間                         */
                                     /*如果該料件不為採購性料件時, 不需輸入   */
                                     /*儲存該料件由採購單發出後至廠商生產交貨 */
                                     /*日期所需天數                           */
                                     /*預設值 依分群碼類別預設 或 '0'         */
ima49       decimal(18),             /*到廠前置期                             */
                                     /*如果該料件不為採購性料件時, 不需輸入   */
                                     /*儲存該料件採購時, 平均交貨到廠所需天數 */
                                     /*預設值 依分群碼類別預設 或 '0'         */
ima491      decimal(18),             /*入庫前置期                             */
                                     /*如果該料件不為採購性料件時, 不需輸入   */
                                     /*儲存該料件採購時, 平均交貨到廠後檢驗所 */
                                     /*需天數                                 */
                                     /*預設值 依分群碼類別預設 或 '0'         */
                                     /*採購收貨入庫時自動計算                 */
ima50       decimal(18),             /*請購安全期                             */
                                     /*文件作業時間                           */
                                     /*如果該料件不為採購性料件時, 不需輸入   */
                                     /*儲存該料件由計劃需求到完成請購作業轉成 */
                                     /*採購單確認完成時, 所需天數             */
                                     /*預設值 依分群碼類別預設 或 '0'         */
ima51       decimal(18),             /*經濟訂購量                             */
ima52       decimal(18),             /*平均訂購量                             */
                                     /*儲存該料件的過去平均的訂購量           */
                                     /*預設值 依分群碼類別預設 或 '1'         */
                                     /*其值為'0'時, 即系統轉換為'1'           */
                                     /*由系統計算而來                         */
                                     /*將作為設定採購/生產倍量的參考依據      */
ima53       decimal(18),             /*最近採購單價                           */
                                     /*最近採購單價 (本幣)                    */
                                     /*如果該料件不為採購性料件時, 不需輸入   */
                                     /*儲存該料件最近一次發出採購的採購單價   */
                                     /*系統維護                               */
ima531      decimal(18),             /*市價                                   */
                                     /*市價 (本幣)                            */
ima532      datetime,                /*市價最近更新日期                       */
ima54       nvarchar(10),            /*主要供應廠商                           */
                                     /*如果該料件不為採購性料件時, 不需輸入   */
                                     /*儲存該料件的主要供貨廠商編號           */
                                     /*如有設定, 需存在供應廠商資料主檔       */
                                     /*預設值 依分群碼類別預設 或 '空白'      */
ima55       nvarchar(4),             /*生產單位                               */
                                     /*該料件的生產單位, 可與料件庫存單位不同 */
                                     /*在以下各所有文件說明中, 稱之'料件生產  */
                                     /*單位' 或 '生產單位'                    */
                                     /*預設值 依分群碼類別預設 或 料件庫存單位*/
                                     /*如果不為可生產料件則可不輸入; 假如, 輸 */
                                     /*入之單位不為料件庫存單位時, 必須有單位 */
                                     /*間的轉換率存在, 且將儲存於下一欄位(生產*/
                                     /*單位/庫存單位換算率)                   */
ima55_fac   decimal(18),             /*生產單位/庫存單位換算率                */
                                     /*儲存該料件的料件生產單位對料件庫存單位 */
                                     /*的轉換率                               */
                                     /*預設值 依分群碼類別預設 或 '0' 或 單位 */
                                     /*間設定的轉換率                         */
ima56       decimal(18),             /*生產單位倍量                           */
                                     /*生產單位批量                           */
                                     /*如果該料件不為生產性料件時, 不需輸入   */
                                     /*儲存該料件生產時, 生產數量的稽核單位數 */
                                     /*量; 若為'0'時, 表示不稽核此項          */
                                     /*預設值 依分群碼類別預設 或 '0'         */
ima561      decimal(18),             /*最少生產數量                           */
                                     /*如果該料件不為生產性料件時, 不需輸入   */
                                     /*儲存該料件生產時, 生產數量的最低水準數 */
                                     /*量; 若為'0'時, 表示不稽核此項          */
                                     /*預設值 依分群碼類別預設 或 '0'         */
ima562      decimal(18),             /*生產損耗率                             */
                                     /*如果該料件不為生產性料件時, 不需輸入   */
                                     /*儲存該料件生產時, 製造數量的可能發生損 */
                                     /*耗率, 為一百分比                       */
                                     /*計劃訂單數量需考慮此數量               */
                                     /*預設值 依分群碼類別預設 或 '0'         */
ima57       smallint,                /*成本階數                               */
                                     /*成本階數 (成會系統使用)                */
                                     /*char(02) -> smallint            No.7269*/
ima571      nvarchar(40),            /*主製程料件                             */
                                     /*製程料號                               */
                                     /*生管系統將以ima571與sfb06讀取製程資料  */
ima58       decimal(18),             /*最後人工工時                           */
                                     /*標準人工工時                           */
                                     /*儲存該料件的標準人工工時               */
                                     /*該料件需為使用成本中心資料計算成本時,  */
                                     /*才有用                                 */
                                     /*成本計算使用製程及工作站時, 則不需輸入 */
ima59       decimal(18),             /*固定前置時間                           */
                                     /*此前置時間可由使用者自行輸入, 或由製程 */
                                     /*及工作站計算而來(以天為單位)           */
ima60       decimal(18),             /*變動前置時間                           */
                                     /*此前置時間可由使用者自行輸入, 或由製程 */
                                     /*及工作站計算而來                       */
ima601      decimal(18),             /*變動前置時間批量                       */
ima61       decimal(18),             /*QC 前置時間                            */
                                     /*此前置時間可由使用者自行輸入           */
ima62       decimal(18),             /*最大累計前置時間                       */
                                     /*此前置時間可由使用者自行輸入, 或由製程 */
                                     /*及工作站計算而來                       */
ima63       nvarchar(4),             /*發料單位                               */
                                     /*該料件的預設發料單位, 而且在作發料數量 */
                                     /*統計的作為基準單位                     */
                                     /*在以下各所有文件說明中, 稱之'料件發料  */
                                     /*單位'                                  */
                                     /*預設值 依分群碼類別預設 或 料件庫存單位*/
                                     /*輸入之單位不為料件庫存單位時, 需有單位 */
                                     /*間的轉換率存在, 且將儲存於下一欄位(發料*/
                                     /*單位/庫存單位換算率)                   */
ima63_fac   decimal(18),             /*發料單位/庫存單位換算率                */
                                     /*儲存該料件的料件發料單位對料件庫存單位 */
                                     /*的轉換率                               */
                                     /*預設值 依分群碼類別預設 或 '0' 或 單位 */
                                     /*間設定的轉換率                         */
ima64       decimal(18),             /*發料單位倍量                           */
                                     /*儲存該料件發料時, 發末數量的稽核單位數 */
                                     /*量; 若為'0'時, 表示不稽核此項          */
                                     /*量產製造系統使用                       */
                                     /*預設值 依分群碼類別預設 或 '0'         */
ima641      decimal(18),             /*最少發料數量                           */
                                     /*儲存該料件發料時, 發料數量的稽核單位數 */
                                     /*量; 若為'0'時, 表示不稽核此項          */
                                     /*量產製造系統使用                       */
                                     /*預設值 依分群碼類別預設 或 '0'         */
ima65       decimal(18),             /*發料安全存量                           */
                                     /*儲存該料件發料時, 發料數量的稽核應保留 */
                                     /*的安全水準數量                         */
                                     /*量產製造系統使用                       */
                                     /*預設值 依分群碼類別預設 或 '0'         */
ima66       decimal(18),             /*發料安全期                             */
                                     /*儲存該料件發料時應在多少天前被發到工作 */
                                     /*區                                     */
                                     /*量產製造系統使用                       */
                                     /*預設值 依分群碼類別預設 或 '0'         */
ima67       nvarchar(10),            /*計劃員                                 */
                                     /*如該料件為生產性料件, 則儲存該料件歸屬 */
                                     /*的計劃員代號                           */
                                     /*如果有設定計劃員, 則需存在 員工檔 內   */
                                     /*預設值 依分群碼類別預設 或 '空白'      */
ima68       decimal(18),             /*需求時距                               */
                                     /*儲存該料件在作主生產排程時, 在此時距點 */
                                     /*之後, 才可考慮預測需求                 */
                                     /*預設值 依分群碼類別預設 或 '0'         */
ima69       decimal(18),             /*計劃時距                               */
                                     /*儲存該料件在作主生產排程時, 在此時距點 */
                                     /*之後, 才可產生計劃訂單                 */
                                     /*預設值 依分群碼類別預設 或 '0'         */
ima70       nvarchar(1),             /*消秏料件                               */
                                     /*正確值 Y/N                             */
                                     /*Y: 消秏料件    (採用領料系統)          */
                                     /*N: 非消秏料件  (採用發料系統)          */
                                     /*預設值 依分群碼類別預設 或 'N'         */
ima71       smallint,                /*儲存有效天數                           */
                                     /*儲存該料件入庫上架後, 有效的存放天數,  */
                                     /*將作為發料使用的優先順序               */
                                     /*如為 '0', 則表示不作此類管制庫存方式   */
                                     /*預設值 依分群碼類別預設 或 '0'         */
ima72       decimal(18),             /*MRP允許交期提前天數                    */
                                     /*MRP 允許交期提前調整天數               */
ima73       datetime,                /*最近入庫日                             */
                                     /*該料件最近一次庫存收貨日期             */
                                     /*系統維護                               */
ima74       datetime,                /*最近出庫日                             */
                                     /*該料件最近一次庫存發貨日期             */
                                     /*系統維護                               */
ima75       nvarchar(15),            /*No Use                                 */
ima76       nvarchar(10),            /*No Use                                 */
ima77       decimal(18),             /*No Use                                 */
ima78       smallint,                /*預算成本階數                           */
                                     /*預算成本階數                02/10/11modi*/
ima79       smallint,                /*No Use                                 */
ima80       smallint,                /*發料低階碼                             */
                                     /*no use                                 */
ima81       smallint,                /*No Use                                 */
ima82       smallint,                /*No Use                                 */
ima83       smallint,                /*No Use                                 */
ima84       smallint,                /*No Use                                 */
ima85       smallint,                /*No Use                                 */
ima851      nvarchar(10),            /*預設工作區                             */
                                     /*需存在預擬工作區檔中                   */
ima852      nvarchar(1),             /*是否為量產料件                         */
                                     /*正確值為 Y/N                           */
ima853      nvarchar(1),             /*檢查該料件是否已捲算過                 */
                                     /*正確值為 Y/N                           */
ima86       nvarchar(4),             /*成本單位                               */
                                     /*在以下各所有文件說明中, 稱之'料件成本  */
                                     /*單位'                                  */
                                     /*預設值 依分群碼類別預設 或 料件庫存單位*/
                                     /*輸入之單位不為料件庫存單位時, 需有單位 */
                                     /*間的轉換率存在, 且將儲存於下一欄位(成本*/
                                     /*單位/庫存單位換算率)                   */
ima86_fac   decimal(18),             /*成本/庫存單位換算率                    */
                                     /*儲存該料件的料件成本單位對料件庫存單位 */
                                     /*的轉換率                               */
                                     /*預設值 依分群碼類別預設 或 '0' 或 單位 */
                                     /*間設定的轉換率                         */
ima87       nvarchar(10),            /*成本項目--材料                         */
                                     /*儲存該料件的材料成本所歸屬的成本結構項目*/
                                     /*需存在 成本項目主檔 內                 */
                                     /*若製造管理系統參數 ASM #058 = "Y"(使用 */
                                     /*成本項目結構)時, 才可輸入              */
                                     /*預設值 依分群碼類別預設 或 '空白'      */
ima871      decimal(18),             /*間接物料分攤率                         */
                                     /*儲存該料件的間接物料成本分攤率         */
                                     /*分攤率, 不為百分比是一因子             */
                                     /*使用此種分攤率作法上, 常設定為         */
                                     /*    一. 成本逆算上, 不包含大宗料件     */
                                     /*    二. 不採用附加成本方式             */
                                     /*    三. 成會間接物料成本計算時使用之   */
                                     /*預設值 依分群碼類別預設 或 '0'         */
ima872      nvarchar(10),            /*材料製造費用成本項目                   */
                                     /*儲存該料件的間接物料成本所歸屬的成本結 */
                                     /*構項目                                 */
                                     /*需存在 成本項目主檔 內                 */
                                     /*若製造管理系統參數 ASM #058 = "Y"(使用 */
                                     /*成本項目結構)時, 才可輸入且分攤率不應  */
                                     /*為 '0'時                               */
                                     /*預設值 依分群碼類別預設 或 '空白'      */
ima873      decimal(18),             /*間接人工分攤率                         */
                                     /*儲存該料件的間接人工成本分攤率         */
                                     /*分攤率, 不為百分比是一因子             */
                                     /*使用此種分攤率作法上, 常設定為         */
                                     /*    一. 成本逆算上, 不包含大宗料件     */
                                     /*    二. 不採用附加成本方式             */
                                     /*預設值 依分群碼類別預設 或 '0'         */
ima874      nvarchar(10),            /*人工製造費用成本項目                   */
                                     /*儲存該料件的間接人工成本所歸屬的成本結 */
                                     /*構項目                                 */
                                     /*需存在 成本項目主檔 內                 */
                                     /*若製造管理系統參數 ASM #058 = "Y"(使用 */
                                     /*成本項目結構)時, 才可輸入且分攤率不應  */
                                     /*為 '0'時                               */
                                     /*預設值 依分群碼類別預設 或 '空白'      */
ima88       decimal(18),             /*期間採購數量                           */
                                     /*儲存該料件的期間固定採購數量           */
                                     /*數量單位為料件庫存單位                 */
                                     /*該料件的補貨策略為期間採購, 才可輸入此 */
                                     /*欄位值, 且一定需輸入                   */
                                     /*預設值 依分群碼類別預設 或 '1'         */
ima881      datetime,                /*期間採購最近採購日期                   */
                                     /*儲存該料件的固定期間採購, 最近一次採購 */
                                     /*日期                                   */
                                     /*作為下次採購的基準日期                 */
                                     /*該料件的補貨策略為期間採購, 才會有儲存 */
                                     /*此欄位日期                             */
                                     /*系統維護                               */
ima89       smallint,                /*期間採購使用的期間                     */
                                     /*期間採購使用的期間(月)                 */
                                     /*儲存該料件的固定期間數/月數            */
                                     /*如下一欄位亦有值時, 固定期間採用本欄   */
                                     /*該料件的補貨策略為期間採購, 才可輸入此 */
                                     /*欄位值, 且一定需與下一欄位作選擇輸入   */
                                     /*預設值 依分群碼類別預設 或 '0'         */
ima90       smallint,                /*期間採購使用的期間                     */
                                     /*期間採購使用的期間(日)                 */
                                     /*儲存該料件的固定期間數/天數            */
                                     /*如上一欄位亦有值時, 固定期間採用上一欄 */
                                     /*該料件的補貨策略為期間採購, 才可輸入此 */
                                     /*欄位值, 且一定需與上一欄位作選擇輸入   */
                                     /*預設值 依分群碼類別預設 或 '0'         */
ima901      datetime,                /*料件建檔日期                           */
                                     /*料件建檔日期           (96/07/09)      */
ima902      datetime,                /*呆滯日期                               */
ima9021     datetime,                /*開帳呆滯日                             */
ima903      nvarchar(1),             /*可否做聯產品入庫                       */
                                     /*可否做聯產品入庫#NO:6872               */
ima904      nvarchar(1),             /*使用者自行定義                         */
ima905      nvarchar(1),             /*當月是否入聯產品                       */
                                     /*當月是否入聯產品#NO:6872               */
ima906      nvarchar(1),             /*單位使用方式                           */
                                     /*      ─IF sma115='N', 本字段 default 1, 不可輸入/更改*/
                                     /*      ─IF sma115='Y', 本字段應 matches [23]*/
ima907      nvarchar(4),             /*第二單位(母單位/參考單位)              */
                                     /*使用者自行定義                         */
ima908      nvarchar(4),             /*計價單位                               */
                                     /*使用者自行定義                         */
ima909      smallint,                /*MRP匯總時距(天)(預留欄位)              */
                                     /*使用者自行定義                         */
ima91       decimal(18),             /*平均採購單價                           */
                                     /*平均採購單價 (本幣)(移動加權平均)      */
                                     /*如果該料件不為採購性料件時, 不需輸入   */
                                     /*儲存該料件加權平均的採購單價           */
                                     /*採購單發出時, 計算之                   */
                                     /*系統維護                               */
ima910      nvarchar(20),            /*主特性代碼                             */
                                     /*使用者自行定義                         */
ima911      nvarchar(1),             /*是否為重覆性生產料件 (Y/N)             */
ima912      decimal(18),             /*標準機器工時                           */
ima913      nvarchar(1),             /*統購否                                 */
ima914      nvarchar(10),            /*採購中心代碼                           */
ima915      nvarchar(1) DEFAULT '0' NOT NULL, /*是否需做供應商的管制*/
                                     /*0.不管制                               */
                                     /*1.請購單需管制                         */
                                     /*2.採購單需管制                         */
                                     /*3.二者皆需管制                         */
ima916      nvarchar(10) DEFAULT ' ' NOT NULL, /*資料來源*/
ima917      integer,                 /*拋轉次數                               */
ima918      nvarchar(1),             /*製造批號管理否                         */
ima919      nvarchar(1),             /*製造批號自動編碼否                     */
ima92       nvarchar(1),             /*NET CHANGE  flag                       */
                                     /*net change flag                        */
                                     /*儲存該料件其產品結構或工單或採購單有異 */
                                     /*動時, 則狀況旗標改為 "Y"               */
                                     /*提供給 MPS/MRP 執行 NET CHANGE 時, 使用*/
                                     /*且會還原為 "N"                         */
                                     /*系統維護                               */
ima920      nvarchar(10),            /*製造批號編碼原則                       */
ima921      nvarchar(1),             /*序號管理否                             */
ima922      nvarchar(1),             /*序號自動編碼否                         */
ima923      nvarchar(10),            /*序號編碼原則                           */
ima924      nvarchar(1),             /*序號唯一否                             */
ima925      nvarchar(1),             /*排序方式                               */
ima926      nvarchar(1) DEFAULT 'N' NOT NULL, /*AVL否*/
ima927      nvarchar(1) DEFAULT 'N' NOT NULL, /*電子採購料件*/
ima93       nvarchar(8),             /*新料件處理狀況                         */
                                     /*new parts status                       */
                                     /*儲存該料件新增後, 設定處理狀況旗標     */
                                     /*系統會自動提示應該被執行的料件資料維護 */
                                     /*作業, 以利使用者作業                   */
                                     /*第一碼 ='Y' 表示有新增修改庫存資料     */
                                     /*第二碼 ='Y' 表示有新增修改銷售資料     */
                                     /*第三碼 ='Y' 表示有新增修改採購資料     */
                                     /*第四碼 ='Y' 表示有新增修改生管資料     */
                                     /*第五碼 ='Y' 表示有新增修改成本資料     */
                                     /*第六碼 ='Y' 表示有新增修改成本要素值資料*/
                                     /*第七碼 ='Y' 表示有新增修改成本項目結構 */
                                     /*第八碼 ='Y' 表示有新增修改品名規格說明 */
                                     /*系統維護                               */
ima94       nvarchar(10),            /*預設製程編號                           */
                                     /*預設製程編號 (工單開立時預設之)        */
ima940      nvarchar(10),            /*顏色組                                 */
ima941      nvarchar(10),            /*尺碼組                                 */
ima95       decimal(18),             /*保稅單價                               */
ima96       smallint,                /*No Use                                 */
ima97       smallint,                /*No Use                                 */
ima98       decimal(18),             /*月加權平均售價                         */
ima99       decimal(18),             /*再補貨量                               */
                                     /*儲存當補貨策略採用再訂購點方式時的再補 */
                                     /*貨量水準數量                           */
                                     /*預設值 依分群碼類別預設 或 '0'         */
                                     /*其值為'0'時, 表示使用最小生產或採購數量*/
imaacti     nvarchar(1),             /*資料有效碼                             */
                                     /*系統維護                               */
imaag       nvarchar(10),            /*屬性群組代碼                           */
imaag1      nvarchar(10),            /*母料件屬性群組代碼                     */
imadate     datetime,                /*最近修改日                             */
                                     /*系統維護                               */
imagrup     nvarchar(10),            /*資料所有群                             */
                                     /*系統維護                               */
imamodu     nvarchar(10),            /*資料更改者                             */
                                     /*系統維護                               */
imaorig     nvarchar(10),            /*資料建立部門                           */
imaoriu     nvarchar(10),            /*資料建立者                             */
imaud01     nvarchar(255),           /*自訂欄位                               */
imaud02     nvarchar(40),            /*自訂欄位                               */
imaud03     nvarchar(40),            /*自訂欄位                               */
imaud04     nvarchar(40),            /*自訂欄位                               */
imaud05     nvarchar(40),            /*自訂欄位                               */
imaud06     nvarchar(255),           /*自訂欄位                               */
imaud07     decimal(18),             /*自訂欄位                               */
imaud08     decimal(18),             /*自訂欄位                               */
imaud09     decimal(18),             /*自訂欄位                               */
imaud10     integer,                 /*自訂欄位                               */
imaud11     integer,                 /*自訂欄位                               */
imaud12     integer,                 /*自訂欄位                               */
imaud13     datetime,                /*自訂欄位                               */
imaud14     datetime,                /*自訂欄位                               */
imaud15     datetime,                /*自訂欄位                               */
imauser     nvarchar(10)             /*資料所有者                             */
                                     /*系統維護                               */
);

create        index ima_03 on ima_file (ima75,ima76);
create        index ima_04 on ima_file (imaacti);
create        index ima_12 on ima_file (ima12);
alter table ima_file add constraint ima_pk primary key  (ima01) deferrable initially deferred;
grant select on ima_file to tiptopgp;
grant update on ima_file to tiptopgp;
grant delete on ima_file to tiptopgp;
grant insert on ima_file to tiptopgp;
grant references on ima_file to tiptopgp;
grant references on ima_file to ods;
grant select on ima_file to ods;
