/*
================================================================================
檔案代號:pie_file
檔案名稱:盤點標籤明細-「在製工單」資料檔
檔案目的:
上游檔案:
下游檔案:
檔案類型:T
多語系檔案:N
============.========================.==========================================
*/
create table pie_file
(
pie01       nvarchar(20) NOT NULL,   /*標籤編號                               */
pie012      nvarchar(10),            /*製程段號                               */
pie013      smallint DEFAULT 0,      /*製程序                                 */
pie02       nvarchar(40),            /*料件編號                               */
                                     /*儲存該工單所屬下階料件編號，應為被發放 */
                                     /*投入生產的料件編號，對「在製工單」而言 */
                                     /*亦是將作此料件數量的盤點。             */
pie03       nvarchar(6),             /*作業編號                               */
                                     /*作業編號 99.12                         */
                                     /*原為smallint現改為char(06) 作業編號    */
                                     /*儲存該工單備料料件，預期投入生產的作業 */
                                     /*所屬作業編號；可由[工單檔]指定的製程編 */
                                     /*號及產品結構而得                       */
pie04       nvarchar(4),             /*發料單位                               */
                                     /*儲存該工單備料料件的發料單位。         */
pie05       nvarchar(10),            /*工作站編號                             */
                                     /*儲存該下階料件應於何工作站被盤點       */
pie06       nvarchar(1),             /*旗標                                   */
                                     /*儲存備料料件的來源特性                 */
                                     /*正確值 E/U/V/R/N                       */
                                     /*E: 消耗性料件                          */
                                     /*U: 大宗自製料件                        */
                                     /*V: 大宗採購料件                        */
                                     /*R: 在製途料件                          */
                                     /*N: 除外一般料件                        */
pie07       smallint NOT NULL,       /*產生項次                               */
                                     /*系統自動賦予                           */
pie08       nvarchar(10),            /*產生人員                               */
                                     /*儲存該筆「在製工單」空白標籤資料產生者。*/
pie09       datetime,                /*產生日期                               */
                                     /*儲存該筆「在製工單」空白標籤資料產生日期*/
pie11       decimal(15,3),           /*應發量                                 */
                                     /*儲存該工單備料料件的應發量。           */
pie12       decimal(15,3),           /*已發量                                 */
                                     /*儲存該工單備料料件的已發量。           */
pie13       decimal(15,3),           /*超領量                                 */
                                     /*儲存該工單備料料件的超領量。           */
                                     /*實收量 ＝ 已發量 ＋ 超領量。           */
pie14       decimal(20,8),           /*標準單位用量                           */
                                     /*標準單位用量(QPA)                      */
pie15       decimal(15,3),           /*報廢數量                               */
pie151      decimal(15,3),           /*代買數量                               */
pie152      decimal(20,8),           /*發料單位/庫存轉換率                    */
pie153      decimal(15,3),           /*應盤數量                               */
                                     /*實際已用量=((完工入庫量 + 報廢數量)    */
                                     /*             * qpa ) + 下階報廢        */
                                     /*應盤數量  =已發數量+超領數量-實際已用量*/
pie16       nvarchar(1),             /*是否已作盤點「過帳」                   */
                                     /*儲存該筆「在製工單」盤點資料是否已被作 */
                                     /*「過帳」處理。                         */
                                     /*--------------- 初盤資料 ---------------*/
pie27       nvarchar(40),            /*No Use                                 */
pie30       decimal(15,3),           /*初盤（一）-- 盤點數量                  */
                                     /*儲存該筆「在製工單」盤點資料在經過初盤 */
                                     /*作業後的被輸入的盤點數量。             */
                                     /*其數量單位為該筆庫存明細之庫存單位。   */
                                     /*盤點過帳時可用此數量作為依據。         */
pie31       nvarchar(10),            /*初盤（一）-- 資料輸入人員代            */
                                     /*儲存該筆「在製工單」盤點資料在經過初盤 */
                                     /*作業後的輸入盤點數量操作人員。         */
pie32       datetime,                /*初盤（一）-- 資料輸入日期              */
                                     /*儲存該筆「在製工單」盤點資料在經過初盤 */
                                     /*作業後的輸入盤點數量操作日期。         */
pie33       nvarchar(8),             /*初盤（一）-- 資料輸入時間              */
                                     /*儲存該筆「在製工單」盤點資料在經過初盤 */
                                     /*作業後的輸入盤點數量操作時間。         */
pie34       nvarchar(10),            /*初盤人員(一)                           */
pie35       datetime,                /*初盤日期(一)                           */
pie40       decimal(15,3),           /*初盤（二）-- 盤點數量                  */
                                     /*儲存該筆「在製工單」盤點資料在經過初盤 */
                                     /*作業後的被輸入的盤點數量。             */
                                     /*其數量單位為該筆庫存明細之庫存單位。   */
                                     /*本欄位僅供比對參考，不作為過帳依據。   */
pie41       nvarchar(10),            /*初盤（二）-- 資料輸入人員代            */
                                     /*儲存該筆「在製工單」盤點資料在經過初盤 */
                                     /*作業後的輸入盤點數量操作人員。         */
pie42       datetime,                /*初盤（二）-- 資料輸入日期              */
                                     /*儲存該筆「在製工單」盤點資料在經過初盤 */
                                     /*作業後的輸入盤點數量操作日期。         */
pie43       nvarchar(8),             /*初盤（二）-- 資料輸入時間              */
                                     /*儲存該筆「在製工單」盤點資料在經過初盤 */
                                     /*作業後的輸入盤點數量操作時間。         */
pie44       nvarchar(10),            /*初盤人員(二)                           */
pie45       datetime,                /*初盤日期(二)                           */
                                     /*--------------- 複盤資料 ---------------*/
pie50       decimal(15,3),           /*複盤（一）-- 盤點數量                  */
                                     /*儲存該筆「在製工單」盤點資料在經過初盤 */
                                     /*或抽盤作業後的被輸入的盤點數量。       */
                                     /*其數量單位為該筆庫存明細之庫存單位。   */
                                     /*盤點過帳時可用此數量作為依據。         */
pie51       nvarchar(10),            /*複盤（一）-- 資料輸入人員代            */
                                     /*儲存該筆「在製工單」盤點資料在經過初盤 */
                                     /*或抽盤作業後的輸入盤點數量操作人員。   */
pie52       datetime,                /*複盤（一）-- 資料輸入日期              */
                                     /*儲存該筆「在製工單」盤點資料在經過初盤 */
                                     /*或抽盤作業後的輸入盤點數量操作日期。   */
pie53       nvarchar(8),             /*複盤（一）-- 資料輸入時間              */
                                     /*儲存該筆「在製工單」盤點資料在經過初盤 */
                                     /*或抽盤作業後的輸入盤點數量操作時間。   */
pie54       nvarchar(10),            /*複盤人員(一)                           */
pie55       datetime,                /*複盤日期(一)                           */
pie60       decimal(15,3),           /*複盤（二）-- 盤點數量                  */
                                     /*儲存該筆「在製工單」盤點資料在經過初盤 */
                                     /*或抽盤作業後的被輸入的盤點數量。       */
                                     /*其數量單位為該筆庫存明細之庫存單位。   */
                                     /*本欄位僅供比對參考，不作為過帳依據。   */
pie61       nvarchar(10),            /*複盤（二）-- 資料輸入人員代            */
                                     /*儲存該筆「在製工單」盤點資料在經過初盤 */
                                     /*或抽盤作業後的輸入盤點數量操作人員。   */
pie62       datetime,                /*複盤（二）-- 資料輸入日期              */
                                     /*儲存該筆「在製工單」盤點資料在經過初盤 */
                                     /*或抽盤作業後的輸入盤點數量操作日期。   */
pie63       nvarchar(8),             /*複盤（二）-- 資料輸入時間              */
                                     /*儲存該筆「在製工單」盤點資料在經過初盤 */
                                     /*或抽盤作業後的輸入盤點數量操作時間。   */
pie64       nvarchar(10),            /*複盤人員(二)                           */
pie65       datetime,                /*複盤日期(二)                           */
pie66       decimal(20,6),           /*標準成本                               */
pie67       decimal(20,6),           /*現時成本                               */
pie68       decimal(20,6),           /*預設成本                               */
                                     /*---------- 使用者自行定義欄位 ----------*/
pie900      nvarchar(40),            /*取替代之主料                           */
                                     /*如無取替代此欄位為空白                 */
                                     /*原為 char(01)                          */
pie901      nvarchar(1),             /*使用者自行定義                         */
pie902      nvarchar(1),             /*使用者自行定義                         */
pie903      nvarchar(1),             /*使用者自行定義                         */
piedate     datetime,                /*盤點過帳日                             */
pielegal    nvarchar(10) NOT NULL,   /*所屬法人                               */
pieplant    nvarchar(10) NOT NULL    /*所屬營運中心                           */
);

create        index pie_02 on pie_file (pie02);
create        index pieplant_idx on pie_file (pieplant);
alter table pie_file add constraint pie_pk primary key  (pie01,pie07);
grant select on pie_file to tiptopgp;
grant update on pie_file to tiptopgp;
grant delete on pie_file to tiptopgp;
grant insert on pie_file to tiptopgp;
grant references on pie_file to tiptopgp;
grant references on pie_file to ods;
grant select on pie_file to ods;
